using System;
using System.Collections.Generic;
using System.Globalization;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Nekote
{
    // Cultures ディレクトリーの最初のクラスなので、共通的なコメントをここに書いておく

    // Cultures ディレクトリーは、ローカライゼーションのうち、主に文字列に関することを扱うクラスを含む
    // 日時の文字列化もこのディレクトリーだが、時差は文字列が関わらないため他のところで

    // ローカルエンコーディングも、Cultures ディレクトリーでは扱われない
    // 国や地域とのゆるい相関があるが、たとえばヨーロッパの言語のローカルエンコーディングは多数の国で使えるなど、一対一の関係とはほど遠い
    // ローカルエンコーディングは、既に、Unicode を基本とする文字列処理からの派生的かつ代替的な表現方法という位置付けになっている
    // どちらかと言えば、「文字列処理」のカテゴリーに属するもの

    // Exceptions ディレクトリーと同様、それぞれのクラス名に接尾辞として Culture を付ける
    // Localization ディレクトリーに *Locale も考えたが、
    //     クラス名の前半が第一に represent するのは CultureInfo なので、culture が主体のクラスと考えるべき

    // nCulture を静的でないクラスとして作り、静的プロパティーの nCulture.JaJp などを用意する選択肢もある
    // その方が、CultureInfo.GetCultures から Select でゴソッと作ったり、キーや添え字でのアクセスを可能にしたりできる
    // しかし、自分が Cultures ディレクトリーにより行いたいのは、むしろ、カルチャーごとの、共通化しにくいコードを整理していくこと
    // たとえば ja-JP では、「この文章は、中学生や各学年の小学生にとって難しくないか」の判別のため、常用漢字のリストを取得できるようにしたい
    // もちろんウェブシステムなどには、RightToLeft も勘案されての、最大公約数的な、どのカルチャーであってもユーザーエクスペリエンスが大きく損なわれない設計が必要
    // しかし、ローカルのアプリケーションにおいては、自分や関係者が習熟しているカルチャーに特化した作り込みも必要になる
    // Cultures ディレクトリーは、そういうコードのためのもの
    // CultureInfo.GetCultures が返すというだけで、全く無知のカルチャーも一応は揃えるところでない
    // シンプルに「カルチャー特有のコードを、Nekote の他の部分とは疎結合で整理していくところ」と認識するのが良いだろう
    // その点において、「Nekote の中核的なコードは n*Culture に一切依存しない」というのが、守るべきルール

    // 日本語には、ja のみと ja-JP の二つがある
    // 日本語に JP 以外が今後生じる可能性は低いため、nJaCulture を作った方が英語も（まずは）nEnCulture で足りるかもしれないと考えたが、
    //     最初から .NET と全く同じように細分化させた上で各部にフォールバックの仕組みを用意する方が、あとで詰まりにくいだろう

    // .NET では、ja のみのようなカルチャーは neutral culture とされるようだ
    // neutral culture での comparer などの生成は非推奨
    // To display and sort data, specify both the language and region ともある

    // CultureInfo Class (System.Globalization) | Microsoft Learn
    // https://learn.microsoft.com/en-us/dotnet/api/system.globalization.cultureinfo

    // CultureInfo.cs
    // https://source.dot.net/#System.Private.CoreLib/src/libraries/System.Private.CoreLib/src/System/Globalization/CultureInfo.cs

    public static class nJaJpCulture
    {
        private static CultureInfo? mCulture;

        public static CultureInfo Culture
        {
            get
            {
                // CultureInfo のインスタンスを得る方法は二つある
                // GetCultureInfo については、
                //     The GetCultureInfo method retrieves a cached, read-only CultureInfo object
                //     It offers better performance than a corresponding call to the CultureInfo.CultureInfo(String) constructor とある
                // コンストラクターの方は、
                //     Initializes a new instance of the CultureInfo class based on the culture specified by name
                //     and on a value that specifies whether to use the user-selected culture settings from Windows とのことで、
                //     Windows にログインしている現在のユーザーが Windows の設定をいじっていれば、それを引き継ぐこともできるようだ
                // n*Culture は、習熟のあるメジャーなカルチャーについて、特有のコードを扱ったり、最善の comparer を取得したりのためのもの
                // システムに登録されているカルチャーをそのまま使いたいため、GetCultureInfo の使用が適する

                // CultureInfo.GetCultureInfo Method (System.Globalization) | Microsoft Learn
                // https://learn.microsoft.com/en-us/dotnet/api/system.globalization.cultureinfo.getcultureinfo

                // CultureInfo Constructor (System.Globalization) | Microsoft Learn
                // https://learn.microsoft.com/en-us/dotnet/api/system.globalization.cultureinfo.-ctor

                // Windows の設定に影響を受けるというのがピンとこなかったので、もう少し調べた
                // CultureInfo.UseUserOverride が false になっていれば、とりあえず大丈夫そう

                // c# - How to detect if CurrentCulture has been customised by the user? - Stack Overflow
                // https://stackoverflow.com/questions/21280754/how-to-detect-if-currentculture-has-been-customised-by-the-user

                // CultureInfo のプロパティーとして得られるものは、InvariantCulture 以外、null あるいは影響あり

                // Console.WriteLine (CultureInfo.CurrentCulture.UseUserOverride); // True
                // Console.WriteLine (CultureInfo.CurrentUICulture.UseUserOverride); // True
                // Console.WriteLine (CultureInfo.DefaultThreadCurrentCulture?.UseUserOverride == null); // True
                // Console.WriteLine (CultureInfo.DefaultThreadCurrentUICulture?.UseUserOverride == null); // True
                // Console.WriteLine (CultureInfo.InstalledUICulture.UseUserOverride); // True
                // Console.WriteLine (CultureInfo.InvariantCulture.UseUserOverride); // False

                // CultureInfo.GetCultureInfo で取得したものは大丈夫
                // Console.WriteLine (nJaJpCulture.Culture.UseUserOverride); // False

                // ja でなく ja-JP として一致していること、その上で UseUserOverride のみ異なることの確認

                // Console.WriteLine (CultureInfo.GetCultureInfo ("ja").LCID); // 17
                // Console.WriteLine (CultureInfo.CurrentCulture.LCID); // 1041
                // Console.WriteLine (nJaJpCulture.Culture.LCID); // 1041

                if (mCulture == null)
                    mCulture = CultureInfo.GetCultureInfo ("ja-JP", predefinedOnly: true);

                return mCulture;
            }
        }

        // CaseSensitiveComparer なども考えたが、.NET 的な命名に
        // In が入っているかどうかで見分けるより分かりやすい

        private static StringComparer? mComparer;

        public static StringComparer Comparer
        {
            get
            {
                if (mComparer == null)
                    mComparer = StringComparer.Create (Culture, ignoreCase: false);

                return mComparer;
            }
        }

        private static StringComparer? mComparerIgnoreCase;

        public static StringComparer ComparerIgnoreCase
        {
            get
            {
                if (mComparerIgnoreCase == null)
                    mComparerIgnoreCase = StringComparer.Create (Culture, ignoreCase: true);

                return mComparerIgnoreCase;
            }
        }

        // Jōyō kanji - Wikipedia
        // https://en.wikipedia.org/wiki/J%C5%8Dy%C5%8D_kanji

        public static readonly char [] JoyoKanji = { '一', '丁', '七', '万', '丈', '三', '上', '下', '不', '与', '且', '世', '丘', '丙', '両', '並', '中', '串', '丸', '丹', '主', '丼', '久', '乏', '乗', '乙', '九', '乞', '乱', '乳', '乾', '亀', '了', '予', '争', '事', '二', '互', '五', '井', '亜', '亡', '交', '享', '京', '亭', '人', '仁', '今', '介', '仏', '仕', '他', '付', '仙', '代', '令', '以', '仮', '仰', '仲', '件', '任', '企', '伎', '伏', '伐', '休', '会', '伝', '伯', '伴', '伸', '伺', '似', '但', '位', '低', '住', '佐', '体', '何', '余', '作', '佳', '併', '使', '例', '侍', '供', '依', '価', '侮', '侯', '侵', '侶', '便', '係', '促', '俊', '俗', '保', '信', '修', '俳', '俵', '俸', '俺', '倉', '個', '倍', '倒', '候', '借', '倣', '値', '倫', '倹', '偉', '偏', '停', '健', '側', '偵', '偶', '偽', '傍', '傑', '傘', '備', '催', '傲', '債', '傷', '傾', '僅', '働', '像', '僕', '僚', '僧', '儀', '億', '儒', '償', '優', '元', '兄', '充', '兆', '先', '光', '克', '免', '児', '党', '入', '全', '八', '公', '六', '共', '兵', '具', '典', '兼', '内', '円', '冊', '再', '冒', '冗', '写', '冠', '冥', '冬', '冶', '冷', '凄', '准', '凍', '凝', '凡', '処', '凶', '凸', '凹', '出', '刀', '刃', '分', '切', '刈', '刊', '刑', '列', '初', '判', '別', '利', '到', '制', '刷', '券', '刹', '刺', '刻', '則', '削', '前', '剖', '剛', '剣', '剤', '剥', '副', '剰', '割', '創', '劇', '力', '功', '加', '劣', '助', '努', '励', '労', '効', '劾', '勃', '勅', '勇', '勉', '動', '勘', '務', '勝', '募', '勢', '勤', '勧', '勲', '勾', '匂', '包', '化', '北', '匠', '匹', '区', '医', '匿', '十', '千', '升', '午', '半', '卑', '卒', '卓', '協', '南', '単', '博', '占', '印', '危', '即', '却', '卵', '卸', '厄', '厘', '厚', '原', '厳', '去', '参', '又', '及', '友', '双', '反', '収', '叔', '取', '受', '叙', '口', '古', '句', '叫', '召', '可', '台', '叱', '史', '右', '号', '司', '各', '合', '吉', '同', '名', '后', '吏', '吐', '向', '君', '吟', '否', '含', '吸', '吹', '呂', '呈', '呉', '告', '周', '呪', '味', '呼', '命', '和', '咲', '咽', '哀', '品', '員', '哲', '哺', '唄', '唆', '唇', '唐', '唯', '唱', '唾', '商', '問', '啓', '善', '喉', '喚', '喜', '喝', '喩', '喪', '喫', '営', '嗅', '嗣', '嘆', '嘱', '嘲', '器', '噴', '嚇', '囚', '四', '回', '因', '団', '困', '囲', '図', '固', '国', '圏', '園', '土', '圧', '在', '地', '坂', '均', '坊', '坑', '坪', '垂', '型', '垣', '埋', '城', '域', '執', '培', '基', '埼', '堀', '堂', '堅', '堆', '堕', '堤', '堪', '報', '場', '塀', '塁', '塊', '塑', '塔', '塗', '塚', '塞', '塩', '填', '塾', '境', '墓', '増', '墜', '墨', '墳', '墾', '壁', '壇', '壊', '壌', '士', '壮', '声', '壱', '売', '変', '夏', '夕', '外', '多', '夜', '夢', '大', '天', '太', '夫', '央', '失', '奇', '奈', '奉', '奏', '契', '奔', '奥', '奨', '奪', '奮', '女', '奴', '好', '如', '妃', '妄', '妊', '妖', '妙', '妥', '妨', '妬', '妹', '妻', '姉', '始', '姓', '委', '姫', '姻', '姿', '威', '娘', '娠', '娯', '婆', '婚', '婦', '婿', '媒', '媛', '嫁', '嫉', '嫌', '嫡', '嬢', '子', '孔', '字', '存', '孝', '季', '孤', '学', '孫', '宅', '宇', '守', '安', '完', '宗', '官', '宙', '定', '宛', '宜', '宝', '実', '客', '宣', '室', '宮', '宰', '害', '宴', '宵', '家', '容', '宿', '寂', '寄', '密', '富', '寒', '寛', '寝', '察', '寡', '寧', '審', '寮', '寸', '寺', '対', '寿', '封', '専', '射', '将', '尉', '尊', '尋', '導', '小', '少', '尚', '就', '尺', '尻', '尼', '尽', '尾', '尿', '局', '居', '屈', '届', '屋', '展', '属', '層', '履', '屯', '山', '岐', '岡', '岩', '岬', '岳', '岸', '峠', '峡', '峰', '島', '崇', '崎', '崖', '崩', '嵐', '川', '州', '巡', '巣', '工', '左', '巧', '巨', '差', '己', '巻', '巾', '市', '布', '帆', '希', '帝', '帥', '師', '席', '帯', '帰', '帳', '常', '帽', '幅', '幕', '幣', '干', '平', '年', '幸', '幹', '幻', '幼', '幽', '幾', '庁', '広', '床', '序', '底', '店', '府', '度', '座', '庫', '庭', '庶', '康', '庸', '廃', '廉', '廊', '延', '廷', '建', '弁', '弄', '弊', '式', '弐', '弓', '弔', '引', '弟', '弥', '弦', '弧', '弱', '張', '強', '弾', '当', '彙', '形', '彩', '彫', '彰', '影', '役', '彼', '往', '征', '径', '待', '律', '後', '徐', '徒', '従', '得', '御', '復', '循', '微', '徳', '徴', '徹', '心', '必', '忌', '忍', '志', '忘', '忙', '応', '忠', '快', '念', '怒', '怖', '思', '怠', '急', '性', '怨', '怪', '恋', '恐', '恒', '恣', '恥', '恨', '恩', '恭', '息', '恵', '悔', '悟', '悠', '患', '悦', '悩', '悪', '悲', '悼', '情', '惑', '惜', '惧', '惨', '惰', '想', '愁', '愉', '意', '愚', '愛', '感', '慄', '慈', '態', '慌', '慎', '慕', '慢', '慣', '慨', '慮', '慰', '慶', '憂', '憎', '憤', '憧', '憩', '憬', '憲', '憶', '憾', '懇', '懐', '懲', '懸', '成', '我', '戒', '戚', '戦', '戯', '戴', '戸', '戻', '房', '所', '扇', '扉', '手', '才', '打', '払', '扱', '扶', '批', '承', '技', '抄', '把', '抑', '投', '抗', '折', '抜', '択', '披', '抱', '抵', '抹', '押', '抽', '担', '拉', '拍', '拐', '拒', '拓', '拘', '拙', '招', '拝', '拠', '拡', '括', '拭', '拳', '拶', '拷', '拾', '持', '指', '挑', '挙', '挟', '挨', '挫', '振', '挿', '捉', '捕', '捗', '捜', '捨', '据', '捻', '掃', '授', '掌', '排', '掘', '掛', '採', '探', '接', '控', '推', '措', '掲', '描', '提', '揚', '換', '握', '揮', '援', '揺', '損', '搬', '搭', '携', '搾', '摂', '摘', '摩', '摯', '撃', '撤', '撮', '撲', '擁', '操', '擦', '擬', '支', '改', '攻', '放', '政', '故', '敏', '救', '敗', '教', '敢', '散', '敬', '数', '整', '敵', '敷', '文', '斉', '斎', '斑', '斗', '料', '斜', '斤', '斥', '斬', '断', '新', '方', '施', '旅', '旋', '族', '旗', '既', '日', '旦', '旧', '旨', '早', '旬', '旺', '昆', '昇', '明', '易', '昔', '星', '映', '春', '昧', '昨', '昭', '是', '昼', '時', '晩', '普', '景', '晴', '晶', '暁', '暇', '暑', '暖', '暗', '暦', '暫', '暮', '暴', '曇', '曖', '曜', '曲', '更', '書', '曹', '曽', '替', '最', '月', '有', '服', '朕', '朗', '望', '朝', '期', '木', '未', '末', '本', '札', '朱', '朴', '机', '朽', '杉', '材', '村', '束', '条', '来', '杯', '東', '松', '板', '析', '枕', '林', '枚', '果', '枝', '枠', '枢', '枯', '架', '柄', '某', '染', '柔', '柱', '柳', '柵', '査', '柿', '栃', '栄', '栓', '校', '株', '核', '根', '格', '栽', '桁', '桃', '案', '桑', '桜', '桟', '梅', '梗', '梨', '械', '棄', '棋', '棒', '棚', '棟', '森', '棺', '椅', '植', '椎', '検', '業', '極', '楷', '楼', '楽', '概', '構', '様', '槽', '標', '模', '権', '横', '樹', '橋', '機', '欄', '欠', '次', '欧', '欲', '欺', '款', '歌', '歓', '止', '正', '武', '歩', '歯', '歳', '歴', '死', '殉', '殊', '残', '殖', '殴', '段', '殺', '殻', '殿', '毀', '母', '毎', '毒', '比', '毛', '氏', '民', '気', '水', '氷', '永', '氾', '汁', '求', '汎', '汗', '汚', '江', '池', '汰', '決', '汽', '沃', '沈', '沖', '沙', '没', '沢', '河', '沸', '油', '治', '沼', '沿', '況', '泉', '泊', '泌', '法', '泡', '波', '泣', '泥', '注', '泰', '泳', '洋', '洗', '洞', '津', '洪', '活', '派', '流', '浄', '浅', '浜', '浦', '浪', '浮', '浴', '海', '浸', '消', '涙', '涯', '液', '涼', '淑', '淡', '淫', '深', '混', '添', '清', '渇', '済', '渉', '渋', '渓', '減', '渡', '渦', '温', '測', '港', '湖', '湧', '湯', '湾', '湿', '満', '源', '準', '溝', '溶', '溺', '滅', '滋', '滑', '滝', '滞', '滴', '漁', '漂', '漆', '漏', '演', '漠', '漢', '漫', '漬', '漸', '潔', '潜', '潟', '潤', '潮', '潰', '澄', '激', '濁', '濃', '濫', '濯', '瀬', '火', '灯', '灰', '災', '炉', '炊', '炎', '炭', '点', '為', '烈', '無', '焦', '然', '焼', '煎', '煙', '照', '煩', '煮', '熊', '熟', '熱', '燃', '燥', '爆', '爪', '爵', '父', '爽', '片', '版', '牙', '牛', '牧', '物', '牲', '特', '犠', '犬', '犯', '状', '狂', '狙', '狩', '独', '狭', '猛', '猟', '猫', '献', '猶', '猿', '獄', '獣', '獲', '玄', '率', '玉', '王', '玩', '珍', '珠', '班', '現', '球', '理', '琴', '瑠', '璃', '璧', '環', '璽', '瓦', '瓶', '甘', '甚', '生', '産', '用', '田', '由', '甲', '申', '男', '町', '画', '界', '畏', '畑', '畔', '留', '畜', '畝', '略', '番', '異', '畳', '畿', '疎', '疑', '疫', '疲', '疾', '病', '症', '痕', '痘', '痛', '痢', '痩', '痴', '瘍', '療', '癒', '癖', '発', '登', '白', '百', '的', '皆', '皇', '皮', '皿', '盆', '益', '盗', '盛', '盟', '監', '盤', '目', '盲', '直', '相', '盾', '省', '眉', '看', '県', '真', '眠', '眺', '眼', '着', '睡', '督', '睦', '瞬', '瞭', '瞳', '矛', '矢', '知', '短', '矯', '石', '砂', '研', '砕', '砲', '破', '硝', '硫', '硬', '碁', '碑', '確', '磁', '磨', '礁', '礎', '示', '礼', '社', '祈', '祉', '祖', '祝', '神', '祥', '票', '祭', '禁', '禅', '禍', '福', '秀', '私', '秋', '科', '秒', '秘', '租', '秩', '称', '移', '程', '税', '稚', '種', '稲', '稼', '稽', '稿', '穀', '穂', '積', '穏', '穫', '穴', '究', '空', '突', '窃', '窒', '窓', '窟', '窮', '窯', '立', '竜', '章', '童', '端', '競', '竹', '笑', '笛', '符', '第', '筆', '等', '筋', '筒', '答', '策', '箇', '箋', '算', '管', '箱', '箸', '節', '範', '築', '篤', '簡', '簿', '籍', '籠', '米', '粉', '粋', '粒', '粗', '粘', '粛', '粧', '精', '糖', '糧', '糸', '系', '糾', '紀', '約', '紅', '紋', '納', '純', '紙', '級', '紛', '素', '紡', '索', '紫', '累', '細', '紳', '紹', '紺', '終', '組', '経', '結', '絞', '絡', '給', '統', '絵', '絶', '絹', '継', '続', '維', '綱', '網', '綻', '綿', '緊', '総', '緑', '緒', '線', '締', '編', '緩', '緯', '練', '緻', '縁', '縄', '縛', '縦', '縫', '縮', '績', '繁', '繊', '織', '繕', '繭', '繰', '缶', '罪', '置', '罰', '署', '罵', '罷', '羅', '羊', '美', '羞', '群', '羨', '義', '羽', '翁', '翌', '習', '翻', '翼', '老', '考', '者', '耐', '耕', '耗', '耳', '聖', '聞', '聴', '職', '肉', '肌', '肖', '肘', '肝', '股', '肢', '肥', '肩', '肪', '肯', '育', '肺', '胃', '胆', '背', '胎', '胞', '胴', '胸', '能', '脂', '脅', '脇', '脈', '脊', '脚', '脱', '脳', '腎', '腐', '腕', '腫', '腰', '腸', '腹', '腺', '膚', '膜', '膝', '膨', '膳', '臆', '臓', '臣', '臨', '自', '臭', '至', '致', '臼', '興', '舌', '舎', '舗', '舞', '舟', '航', '般', '舶', '舷', '船', '艇', '艦', '良', '色', '艶', '芋', '芝', '芯', '花', '芳', '芸', '芽', '苗', '苛', '若', '苦', '英', '茂', '茎', '茨', '茶', '草', '荒', '荘', '荷', '菊', '菌', '菓', '菜', '華', '萎', '落', '葉', '著', '葛', '葬', '蒸', '蓄', '蓋', '蔑', '蔵', '蔽', '薄', '薦', '薪', '薫', '薬', '藍', '藤', '藩', '藻', '虎', '虐', '虚', '虜', '虞', '虫', '虹', '蚊', '蚕', '蛇', '蛍', '蛮', '蜂', '蜜', '融', '血', '衆', '行', '術', '街', '衛', '衝', '衡', '衣', '表', '衰', '衷', '袋', '袖', '被', '裁', '裂', '装', '裏', '裕', '補', '裸', '製', '裾', '複', '褐', '褒', '襟', '襲', '西', '要', '覆', '覇', '見', '規', '視', '覚', '覧', '親', '観', '角', '解', '触', '言', '訂', '訃', '計', '討', '訓', '託', '記', '訟', '訪', '設', '許', '訳', '訴', '診', '証', '詐', '詔', '評', '詞', '詠', '詣', '試', '詩', '詮', '詰', '話', '該', '詳', '誇', '誉', '誌', '認', '誓', '誕', '誘', '語', '誠', '誤', '説', '読', '誰', '課', '調', '談', '請', '論', '諦', '諧', '諭', '諮', '諸', '諾', '謀', '謁', '謄', '謎', '謙', '講', '謝', '謡', '謹', '識', '譜', '警', '議', '譲', '護', '谷', '豆', '豊', '豚', '象', '豪', '貌', '貝', '貞', '負', '財', '貢', '貧', '貨', '販', '貪', '貫', '責', '貯', '貴', '買', '貸', '費', '貼', '貿', '賀', '賂', '賃', '賄', '資', '賊', '賓', '賛', '賜', '賞', '賠', '賢', '賦', '質', '賭', '購', '贈', '赤', '赦', '走', '赴', '起', '超', '越', '趣', '足', '距', '跡', '路', '跳', '践', '踊', '踏', '踪', '蹴', '躍', '身', '車', '軌', '軍', '軒', '軟', '転', '軸', '軽', '較', '載', '輝', '輩', '輪', '輸', '轄', '辛', '辞', '辣', '辱', '農', '辺', '込', '迅', '迎', '近', '返', '迫', '迭', '述', '迷', '追', '退', '送', '逃', '逆', '透', '逐', '逓', '途', '通', '逝', '速', '造', '連', '逮', '週', '進', '逸', '遂', '遅', '遇', '遊', '運', '遍', '過', '道', '達', '違', '遜', '遠', '遡', '遣', '適', '遭', '遮', '遵', '遷', '選', '遺', '避', '還', '那', '邦', '邪', '邸', '郊', '郎', '郡', '部', '郭', '郵', '郷', '都', '酌', '配', '酎', '酒', '酔', '酢', '酪', '酬', '酵', '酷', '酸', '醒', '醜', '醸', '采', '釈', '里', '重', '野', '量', '金', '釜', '針', '釣', '鈍', '鈴', '鉄', '鉛', '鉢', '鉱', '銀', '銃', '銅', '銘', '銭', '鋭', '鋳', '鋼', '錠', '錦', '錬', '錮', '錯', '録', '鍋', '鍛', '鍵', '鎌', '鎖', '鎮', '鏡', '鐘', '鑑', '長', '門', '閉', '開', '閑', '間', '関', '閣', '閥', '閲', '闇', '闘', '阜', '阪', '防', '阻', '附', '降', '限', '陛', '院', '陣', '除', '陥', '陪', '陰', '陳', '陵', '陶', '陸', '険', '陽', '隅', '隆', '隊', '階', '随', '隔', '隙', '際', '障', '隠', '隣', '隷', '隻', '雄', '雅', '集', '雇', '雌', '雑', '離', '難', '雨', '雪', '雰', '雲', '零', '雷', '電', '需', '震', '霊', '霜', '霧', '露', '青', '静', '非', '面', '革', '靴', '韓', '音', '韻', '響', '頂', '頃', '項', '順', '須', '預', '頑', '頒', '頓', '領', '頬', '頭', '頻', '頼', '題', '額', '顎', '顔', '顕', '願', '類', '顧', '風', '飛', '食', '飢', '飯', '飲', '飼', '飽', '飾', '餅', '養', '餌', '餓', '館', '首', '香', '馬', '駄', '駅', '駆', '駐', '駒', '騎', '騒', '験', '騰', '驚', '骨', '骸', '髄', '高', '髪', '鬱', '鬼', '魂', '魅', '魔', '魚', '鮮', '鯨', '鳥', '鳴', '鶏', '鶴', '鹿', '麓', '麗', '麦', '麺', '麻', '黄', '黒', '黙', '鼓', '鼻', '齢' };

        // 常用漢字には、現時点で4文字、JIS X 0208 に収まらないが、より正確な字体とされるものがある
        // そのうち一つは Unicode の BMP 面にも収まらず、サロゲートペアでないと扱えない
        // いずれも BMP 面には収まるなら置換しないが、1文字だけ char でさえないと扱いに困るので四つとも置換

        // 次のページには、The "New" column attempts to reflect the official glyph shapes as closely as possible
        //     This requires using the characters 𠮟, 塡, 剝, 頰 which are outside of Japan's basic character set, JIS X 0208 (one of them is also outside the Unicode BMP)
        //     In practice, these characters are usually replaced by the characters 叱, 填, 剥, 頬, which are present in JIS X 0208 とある

        // List of jōyō kanji - Wikipedia
        // https://en.wikipedia.org/wiki/List_of_j%C5%8Dy%C5%8D_kanji

        // uint で考えていたが、.NET のメソッドは int なので、それにならう

        // Char.ConvertFromUtf32(Int32) Method (System) | Microsoft Learn
        // https://learn.microsoft.com/en-us/dotnet/api/system.char.convertfromutf32

        public static readonly int [,] JoyoKanjiAlt = new int [,]
        {
            { '叱', 0x20B9F },
            { '填', '塡' },
            { '剥', '剝' },
            { '頬', '頰' }
        };

        // 厳密には「教育漢字」は1～6年生までの1026文字に限られるようだが、
        //     分かりやすいので、中学（以降？）のものも含めてフィールド名に採用
        // 中学（以降？）も同じ配列に入れるのは、ループや LINQ での処理を想定してのこと
        // 常用漢字から1～6年生の漢字を引けば得られるが、わずかなデータなので初めから用意しておく

        // 教育漢字 - Wikipedia
        // https://ja.wikipedia.org/wiki/%E6%95%99%E8%82%B2%E6%BC%A2%E5%AD%97

        // Kyōiku kanji - Wikipedia
        // https://en.wikipedia.org/wiki/Ky%C5%8Diku_kanji

        public static readonly char [][] KyoikuKanji =
        {
            new char [] { '一', '七', '三', '上', '下', '中', '九', '二', '五', '人', '休', '先', '入', '八', '六', '円', '出', '力', '十', '千', '口', '右', '名', '四', '土', '夕', '大', '天', '女', '子', '字', '学', '小', '山', '川', '左', '年', '手', '文', '日', '早', '月', '木', '本', '村', '林', '校', '森', '正', '気', '水', '火', '犬', '玉', '王', '生', '田', '男', '町', '白', '百', '目', '石', '空', '立', '竹', '糸', '耳', '花', '草', '虫', '見', '貝', '赤', '足', '車', '金', '雨', '青', '音' },
            new char [] { '万', '丸', '交', '京', '今', '会', '体', '何', '作', '元', '兄', '光', '公', '内', '冬', '刀', '分', '切', '前', '北', '午', '半', '南', '原', '友', '古', '台', '合', '同', '回', '図', '国', '園', '地', '場', '声', '売', '夏', '外', '多', '夜', '太', '妹', '姉', '室', '家', '寺', '少', '岩', '工', '市', '帰', '広', '店', '弓', '引', '弟', '弱', '強', '当', '形', '後', '心', '思', '戸', '才', '教', '数', '新', '方', '明', '星', '春', '昼', '時', '晴', '曜', '書', '朝', '来', '東', '楽', '歌', '止', '歩', '母', '毎', '毛', '池', '汽', '活', '海', '点', '父', '牛', '理', '用', '画', '番', '直', '矢', '知', '社', '秋', '科', '答', '算', '米', '紙', '細', '組', '絵', '線', '羽', '考', '聞', '肉', '自', '船', '色', '茶', '行', '西', '親', '角', '言', '計', '記', '話', '語', '読', '谷', '買', '走', '近', '通', '週', '道', '遠', '里', '野', '長', '門', '間', '雪', '雲', '電', '頭', '顔', '風', '食', '首', '馬', '高', '魚', '鳥', '鳴', '麦', '黄', '黒' },
            new char [] { '丁', '世', '両', '主', '乗', '予', '事', '仕', '他', '代', '住', '使', '係', '倍', '全', '具', '写', '列', '助', '勉', '動', '勝', '化', '区', '医', '去', '反', '取', '受', '号', '向', '君', '味', '命', '和', '品', '員', '商', '問', '坂', '央', '始', '委', '守', '安', '定', '実', '客', '宮', '宿', '寒', '対', '局', '屋', '岸', '島', '州', '帳', '平', '幸', '度', '庫', '庭', '式', '役', '待', '急', '息', '悪', '悲', '想', '意', '感', '所', '打', '投', '拾', '持', '指', '放', '整', '旅', '族', '昔', '昭', '暑', '暗', '曲', '有', '服', '期', '板', '柱', '根', '植', '業', '様', '横', '橋', '次', '歯', '死', '氷', '決', '油', '波', '注', '泳', '洋', '流', '消', '深', '温', '港', '湖', '湯', '漢', '炭', '物', '球', '由', '申', '界', '畑', '病', '発', '登', '皮', '皿', '相', '県', '真', '着', '短', '研', '礼', '神', '祭', '福', '秒', '究', '章', '童', '笛', '第', '筆', '等', '箱', '級', '終', '緑', '練', '羊', '美', '習', '者', '育', '苦', '荷', '落', '葉', '薬', '血', '表', '詩', '調', '談', '豆', '負', '起', '路', '身', '転', '軽', '農', '返', '追', '送', '速', '進', '遊', '運', '部', '都', '配', '酒', '重', '鉄', '銀', '開', '院', '陽', '階', '集', '面', '題', '飲', '館', '駅', '鼻' },
            new char [] { '不', '争', '付', '令', '以', '仲', '伝', '位', '低', '例', '便', '信', '倉', '候', '借', '停', '健', '側', '働', '億', '兆', '児', '共', '兵', '典', '冷', '初', '別', '利', '刷', '副', '功', '加', '努', '労', '勇', '包', '卒', '協', '単', '博', '印', '参', '史', '司', '各', '告', '周', '唱', '喜', '器', '囲', '固', '型', '堂', '塩', '士', '変', '夫', '失', '好', '季', '孫', '完', '官', '害', '察', '巣', '差', '希', '席', '帯', '底', '府', '康', '建', '径', '徒', '得', '必', '念', '愛', '成', '戦', '折', '挙', '改', '救', '敗', '散', '料', '旗', '昨', '景', '最', '望', '未', '末', '札', '材', '束', '松', '果', '栄', '案', '梅', '械', '極', '標', '機', '欠', '歴', '残', '殺', '毒', '氏', '民', '求', '治', '法', '泣', '浅', '浴', '清', '満', '漁', '灯', '無', '然', '焼', '照', '熱', '牧', '特', '産', '的', '省', '祝', '票', '種', '積', '競', '笑', '管', '節', '粉', '紀', '約', '結', '給', '続', '置', '老', '胃', '脈', '腸', '臣', '航', '良', '芸', '芽', '英', '菜', '街', '衣', '要', '覚', '観', '訓', '試', '説', '課', '議', '象', '貨', '貯', '費', '賞', '軍', '輪', '辞', '辺', '連', '達', '選', '郡', '量', '録', '鏡', '関', '陸', '隊', '静', '順', '願', '類', '飛', '飯', '養', '験' },
            new char [] { '久', '仏', '仮', '件', '任', '似', '余', '価', '保', '修', '俵', '個', '備', '像', '再', '刊', '判', '制', '券', '則', '効', '務', '勢', '厚', '句', '可', '営', '因', '団', '圧', '在', '均', '基', '報', '境', '墓', '増', '夢', '妻', '婦', '容', '寄', '富', '導', '居', '属', '布', '師', '常', '幹', '序', '弁', '張', '往', '復', '徳', '志', '応', '快', '性', '恩', '情', '態', '慣', '承', '技', '招', '授', '採', '接', '提', '損', '支', '政', '故', '敵', '断', '旧', '易', '暴', '条', '枝', '査', '格', '桜', '検', '構', '武', '比', '永', '河', '液', '混', '減', '測', '準', '演', '潔', '災', '燃', '版', '犯', '状', '独', '率', '現', '留', '略', '益', '眼', '破', '確', '示', '祖', '禁', '移', '程', '税', '築', '精', '素', '経', '統', '絶', '綿', '総', '編', '績', '織', '罪', '群', '義', '耕', '職', '肥', '能', '興', '舌', '舎', '術', '衛', '製', '複', '規', '解', '設', '許', '証', '評', '講', '謝', '識', '護', '豊', '財', '貧', '責', '貸', '貿', '賀', '資', '賛', '質', '輸', '述', '迷', '退', '逆', '造', '過', '適', '酸', '鉱', '銅', '銭', '防', '限', '険', '際', '雑', '非', '預', '領', '額', '飼' },
            new char [] { '並', '乱', '乳', '亡', '仁', '供', '俳', '値', '傷', '優', '党', '冊', '処', '刻', '割', '創', '劇', '勤', '危', '卵', '厳', '収', '后', '否', '吸', '呼', '善', '困', '垂', '城', '域', '奏', '奮', '姿', '存', '孝', '宅', '宇', '宗', '宙', '宝', '宣', '密', '寸', '専', '射', '将', '尊', '就', '尺', '届', '展', '層', '己', '巻', '幕', '干', '幼', '庁', '座', '延', '律', '従', '忘', '忠', '憲', '我', '批', '担', '拝', '拡', '捨', '探', '推', '揮', '操', '敬', '映', '晩', '暖', '暮', '朗', '机', '枚', '染', '株', '棒', '模', '権', '樹', '欲', '段', '沿', '泉', '洗', '派', '済', '源', '潮', '激', '灰', '熟', '片', '班', '異', '疑', '痛', '皇', '盛', '盟', '看', '砂', '磁', '私', '秘', '穀', '穴', '窓', '筋', '策', '簡', '糖', '系', '紅', '納', '純', '絹', '縦', '縮', '署', '翌', '聖', '肺', '背', '胸', '脳', '腹', '臓', '臨', '至', '若', '著', '蒸', '蔵', '蚕', '衆', '裁', '装', '裏', '補', '視', '覧', '討', '訪', '訳', '詞', '誌', '認', '誕', '誠', '誤', '論', '諸', '警', '貴', '賃', '遺', '郵', '郷', '針', '鋼', '閉', '閣', '降', '陛', '除', '障', '難', '革', '頂', '骨' },
            new char [] { '丈', '与', '且', '丘', '丙', '串', '丹', '丼', '乏', '乙', '乞', '乾', '亀', '了', '互', '井', '亜', '享', '亭', '介', '仙', '仰', '企', '伎', '伏', '伐', '伯', '伴', '伸', '伺', '但', '佐', '佳', '併', '侍', '依', '侮', '侯', '侵', '侶', '促', '俊', '俗', '俸', '俺', '倒', '倣', '倫', '倹', '偉', '偏', '偵', '偶', '偽', '傍', '傑', '傘', '催', '傲', '債', '傾', '僅', '僕', '僚', '僧', '儀', '儒', '償', '充', '克', '免', '兼', '冒', '冗', '冠', '冥', '冶', '凄', '准', '凍', '凝', '凡', '凶', '凸', '凹', '刃', '刈', '刑', '到', '刹', '刺', '削', '剖', '剛', '剣', '剤', '剥', '剰', '劣', '励', '劾', '勃', '勅', '勘', '募', '勧', '勲', '勾', '匂', '匠', '匹', '匿', '升', '卑', '卓', '占', '即', '却', '卸', '厄', '厘', '又', '及', '双', '叔', '叙', '叫', '召', '叱', '吉', '吏', '吐', '吟', '含', '吹', '呂', '呈', '呉', '呪', '咲', '咽', '哀', '哲', '哺', '唄', '唆', '唇', '唐', '唯', '唾', '啓', '喉', '喚', '喝', '喩', '喪', '喫', '嗅', '嗣', '嘆', '嘱', '嘲', '噴', '嚇', '囚', '圏', '坊', '坑', '坪', '垣', '埋', '執', '培', '埼', '堀', '堅', '堆', '堕', '堤', '堪', '塀', '塁', '塊', '塑', '塔', '塗', '塚', '塞', '填', '塾', '墜', '墨', '墳', '墾', '壁', '壇', '壊', '壌', '壮', '壱', '奇', '奈', '奉', '契', '奔', '奥', '奨', '奪', '奴', '如', '妃', '妄', '妊', '妖', '妙', '妥', '妨', '妬', '姓', '姫', '姻', '威', '娘', '娠', '娯', '婆', '婚', '婿', '媒', '媛', '嫁', '嫉', '嫌', '嫡', '嬢', '孔', '孤', '宛', '宜', '宰', '宴', '宵', '寂', '寛', '寝', '寡', '寧', '審', '寮', '寿', '封', '尉', '尋', '尚', '尻', '尼', '尽', '尾', '尿', '屈', '履', '屯', '岐', '岡', '岬', '岳', '峠', '峡', '峰', '崇', '崎', '崖', '崩', '嵐', '巡', '巧', '巨', '巾', '帆', '帝', '帥', '帽', '幅', '幣', '幻', '幽', '幾', '床', '庶', '庸', '廃', '廉', '廊', '廷', '弄', '弊', '弐', '弔', '弥', '弦', '弧', '弾', '彙', '彩', '彫', '彰', '影', '彼', '征', '徐', '御', '循', '微', '徴', '徹', '忌', '忍', '忙', '怒', '怖', '怠', '怨', '怪', '恋', '恐', '恒', '恣', '恥', '恨', '恭', '恵', '悔', '悟', '悠', '患', '悦', '悩', '悼', '惑', '惜', '惧', '惨', '惰', '愁', '愉', '愚', '慄', '慈', '慌', '慎', '慕', '慢', '慨', '慮', '慰', '慶', '憂', '憎', '憤', '憧', '憩', '憬', '憶', '憾', '懇', '懐', '懲', '懸', '戒', '戚', '戯', '戴', '戻', '房', '扇', '扉', '払', '扱', '扶', '抄', '把', '抑', '抗', '抜', '択', '披', '抱', '抵', '抹', '押', '抽', '拉', '拍', '拐', '拒', '拓', '拘', '拙', '拠', '括', '拭', '拳', '拶', '拷', '挑', '挟', '挨', '挫', '振', '挿', '捉', '捕', '捗', '捜', '据', '捻', '掃', '掌', '排', '掘', '掛', '控', '措', '掲', '描', '揚', '換', '握', '援', '揺', '搬', '搭', '携', '搾', '摂', '摘', '摩', '摯', '撃', '撤', '撮', '撲', '擁', '擦', '擬', '攻', '敏', '敢', '敷', '斉', '斎', '斑', '斗', '斜', '斤', '斥', '斬', '施', '旋', '既', '旦', '旨', '旬', '旺', '昆', '昇', '昧', '是', '普', '晶', '暁', '暇', '暦', '暫', '曇', '曖', '更', '曹', '曽', '替', '朕', '朱', '朴', '朽', '杉', '杯', '析', '枕', '枠', '枢', '枯', '架', '柄', '某', '柔', '柳', '柵', '柿', '栃', '栓', '核', '栽', '桁', '桃', '桑', '桟', '梗', '梨', '棄', '棋', '棚', '棟', '棺', '椅', '椎', '楷', '楼', '概', '槽', '欄', '欧', '欺', '款', '歓', '歳', '殉', '殊', '殖', '殴', '殻', '殿', '毀', '氾', '汁', '汎', '汗', '汚', '江', '汰', '沃', '沈', '沖', '沙', '没', '沢', '沸', '沼', '況', '泊', '泌', '泡', '泥', '泰', '洞', '津', '洪', '浄', '浜', '浦', '浪', '浮', '浸', '涙', '涯', '涼', '淑', '淡', '淫', '添', '渇', '渉', '渋', '渓', '渡', '渦', '湧', '湾', '湿', '溝', '溶', '溺', '滅', '滋', '滑', '滝', '滞', '滴', '漂', '漆', '漏', '漠', '漫', '漬', '漸', '潜', '潟', '潤', '潰', '澄', '濁', '濃', '濫', '濯', '瀬', '炉', '炊', '炎', '為', '烈', '焦', '煎', '煙', '煩', '煮', '熊', '燥', '爆', '爪', '爵', '爽', '牙', '牲', '犠', '狂', '狙', '狩', '狭', '猛', '猟', '猫', '献', '猶', '猿', '獄', '獣', '獲', '玄', '玩', '珍', '珠', '琴', '瑠', '璃', '璧', '環', '璽', '瓦', '瓶', '甘', '甚', '甲', '畏', '畔', '畜', '畝', '畳', '畿', '疎', '疫', '疲', '疾', '症', '痕', '痘', '痢', '痩', '痴', '瘍', '療', '癒', '癖', '皆', '盆', '盗', '監', '盤', '盲', '盾', '眉', '眠', '眺', '睡', '督', '睦', '瞬', '瞭', '瞳', '矛', '矯', '砕', '砲', '硝', '硫', '硬', '碁', '碑', '磨', '礁', '礎', '祈', '祉', '祥', '禅', '禍', '秀', '租', '秩', '称', '稚', '稲', '稼', '稽', '稿', '穂', '穏', '穫', '突', '窃', '窒', '窟', '窮', '窯', '竜', '端', '符', '筒', '箇', '箋', '箸', '範', '篤', '簿', '籍', '籠', '粋', '粒', '粗', '粘', '粛', '粧', '糧', '糾', '紋', '紛', '紡', '索', '紫', '累', '紳', '紹', '紺', '絞', '絡', '継', '維', '綱', '網', '綻', '緊', '緒', '締', '緩', '緯', '緻', '縁', '縄', '縛', '縫', '繁', '繊', '繕', '繭', '繰', '缶', '罰', '罵', '罷', '羅', '羞', '羨', '翁', '翻', '翼', '耐', '耗', '聴', '肌', '肖', '肘', '肝', '股', '肢', '肩', '肪', '肯', '胆', '胎', '胞', '胴', '脂', '脅', '脇', '脊', '脚', '脱', '腎', '腐', '腕', '腫', '腰', '腺', '膚', '膜', '膝', '膨', '膳', '臆', '臭', '致', '臼', '舗', '舞', '舟', '般', '舶', '舷', '艇', '艦', '艶', '芋', '芝', '芯', '芳', '苗', '苛', '茂', '茎', '茨', '荒', '荘', '菊', '菌', '菓', '華', '萎', '葛', '葬', '蓄', '蓋', '蔑', '蔽', '薄', '薦', '薪', '薫', '藍', '藤', '藩', '藻', '虎', '虐', '虚', '虜', '虞', '虹', '蚊', '蛇', '蛍', '蛮', '蜂', '蜜', '融', '衝', '衡', '衰', '衷', '袋', '袖', '被', '裂', '裕', '裸', '裾', '褐', '褒', '襟', '襲', '覆', '覇', '触', '訂', '訃', '託', '訟', '訴', '診', '詐', '詔', '詠', '詣', '詮', '詰', '該', '詳', '誇', '誉', '誓', '誘', '誰', '請', '諦', '諧', '諭', '諮', '諾', '謀', '謁', '謄', '謎', '謙', '謡', '謹', '譜', '譲', '豚', '豪', '貌', '貞', '貢', '販', '貪', '貫', '貼', '賂', '賄', '賊', '賓', '賜', '賠', '賢', '賦', '賭', '購', '贈', '赦', '赴', '超', '越', '趣', '距', '跡', '跳', '践', '踊', '踏', '踪', '蹴', '躍', '軌', '軒', '軟', '軸', '較', '載', '輝', '輩', '轄', '辛', '辣', '辱', '込', '迅', '迎', '迫', '迭', '逃', '透', '逐', '逓', '途', '逝', '逮', '逸', '遂', '遅', '遇', '遍', '違', '遜', '遡', '遣', '遭', '遮', '遵', '遷', '避', '還', '那', '邦', '邪', '邸', '郊', '郎', '郭', '酌', '酎', '酔', '酢', '酪', '酬', '酵', '酷', '醒', '醜', '醸', '采', '釈', '釜', '釣', '鈍', '鈴', '鉛', '鉢', '銃', '銘', '鋭', '鋳', '錠', '錦', '錬', '錮', '錯', '鍋', '鍛', '鍵', '鎌', '鎖', '鎮', '鐘', '鑑', '閑', '閥', '閲', '闇', '闘', '阜', '阪', '阻', '附', '陣', '陥', '陪', '陰', '陳', '陵', '陶', '隅', '隆', '随', '隔', '隙', '隠', '隣', '隷', '隻', '雄', '雅', '雇', '雌', '離', '雰', '零', '雷', '需', '震', '霊', '霜', '霧', '露', '靴', '韓', '韻', '響', '頃', '項', '須', '頑', '頒', '頓', '頬', '頻', '頼', '顎', '顕', '顧', '飢', '飽', '飾', '餅', '餌', '餓', '香', '駄', '駆', '駐', '駒', '騎', '騒', '騰', '驚', '骸', '髄', '髪', '鬱', '鬼', '魂', '魅', '魔', '鮮', '鯨', '鶏', '鶴', '鹿', '麓', '麗', '麺', '麻', '黙', '鼓', '齢' }
        };

        // Jinmeiyō kanji - Wikipedia
        // https://en.wikipedia.org/wiki/Jinmeiy%C5%8D_kanji

        public static readonly char [][] JinmeiyoKanji =
        {
            new char [] { '丑', '丞', '乃', '之', '乎', '也', '云', '亘', '亙', '些', '亥', '亦', '亨', '亮', '仔', '伊', '伍', '伶', '伽', '佃', '佑', '侃', '侑', '俄', '俐', '俠', '俣', '俱', '倖', '倦', '倭', '偲', '傭', '儲', '允', '兎', '兜', '其', '冴', '凌', '凛', '凜', '凧', '凪', '凰', '凱', '函', '劉', '劫', '勁', '勺', '勿', '匁', '匡', '卜', '卯', '卿', '厨', '厩', '叉', '叡', '叢', '只', '叶', '吞', '吻', '吾', '哉', '哨', '哩', '啄', '喋', '喧', '喬', '喰', '嘉', '嘗', '嘩', '噂', '噌', '圃', '圭', '坐', '坦', '埴', '堯', '堰', '堵', '堺', '塙', '壕', '壬', '夷', '奄', '奎', '套', '姥', '姪', '娃', '娩', '嬉', '孜', '孟', '宋', '宏', '宕', '宥', '寅', '寓', '寵', '尖', '尤', '尭', '屑', '峨', '峻', '崚', '嵩', '嵯', '嶺', '巌', '巖', '巫', '已', '巳', '巴', '巷', '巽', '帖', '幌', '幡', '庄', '庇', '庚', '庵', '廟', '廻', '廿', '弘', '弛', '彗', '彦', '彪', '彬', '徠', '徽', '忽', '怜', '恕', '恢', '恰', '悉', '悌', '惇', '惚', '惟', '惣', '惹', '惺', '慧', '憐', '戊', '或', '戟', '托', '按', '挺', '挽', '捧', '捲', '捷', '捺', '掠', '掬', '揃', '摑', '摺', '撒', '撞', '撫', '播', '撰', '擢', '敦', '斐', '斡', '斧', '斯', '於', '旭', '昂', '昊', '昌', '昏', '昴', '晃', '晄', '晋', '晏', '晒', '晟', '晦', '晨', '智', '暉', '暢', '曙', '曝', '曳', '朋', '朔', '李', '杏', '杖', '杜', '杭', '杵', '杷', '枇', '柊', '柏', '柑', '柘', '柚', '柴', '柾', '栖', '栗', '栞', '桂', '桐', '桔', '桧', '桶', '梁', '梓', '梛', '梢', '梧', '梯', '梶', '棲', '椀', '椋', '椛', '椰', '椿', '楊', '楓', '楕', '楚', '楠', '楢', '楯', '榊', '榎', '榛', '槇', '槌', '槍', '槙', '槻', '樋', '樟', '樫', '樺', '樽', '橘', '橙', '檀', '檎', '檜', '櫂', '櫓', '櫛', '欣', '欽', '歎', '此', '殆', '毅', '毘', '毬', '汀', '汐', '汝', '汲', '沌', '沓', '沫', '洛', '洲', '洵', '洸', '浩', '浬', '淀', '淋', '淳', '淵', '渚', '渥', '渾', '湊', '湘', '湛', '溜', '溢', '滉', '漕', '漣', '漱', '澪', '濡', '瀕', '灘', '灸', '灼', '烏', '焚', '焰', '煉', '煌', '煤', '熙', '燎', '燕', '燦', '燭', '燿', '爾', '牒', '牟', '牡', '牽', '犀', '狼', '猪', '獅', '玖', '玲', '珀', '珂', '珈', '珊', '琉', '琢', '琥', '琳', '琵', '琶', '瑚', '瑛', '瑞', '瑳', '瑶', '瓜', '瓢', '甥', '甫', '畠', '畢', '疋', '疏', '皐', '皓', '眸', '瞥', '矩', '砥', '砦', '砧', '硯', '碓', '碗', '碧', '碩', '磐', '磯', '祁', '祇', '祐', '祢', '祷', '祿', '禄', '禎', '禰', '禱', '禽', '禾', '秤', '秦', '稀', '稔', '稜', '稟', '穣', '穰', '穹', '穿', '窄', '窪', '窺', '竣', '竪', '竺', '竿', '笈', '笙', '笠', '笹', '筈', '筑', '箔', '箕', '篇', '篠', '簞', '簾', '籾', '粟', '粥', '糊', '紐', '紗', '紘', '紬', '絃', '絆', '絢', '綜', '綴', '綸', '綺', '綾', '緋', '縞', '繡', '繫', '纂', '纏', '羚', '翔', '翠', '耀', '而', '耶', '耽', '聡', '肇', '肋', '肴', '胡', '胤', '脩', '脹', '腔', '膏', '臥', '舜', '舵', '芙', '芥', '芦', '芭', '芹', '苑', '苔', '苺', '茄', '茅', '茉', '茜', '茸', '荻', '莉', '莞', '莫', '菅', '菖', '菩', '菫', '菱', '萄', '萊', '萌', '萠', '萩', '萱', '葡', '董', '葦', '葵', '葺', '蒐', '蒔', '蒙', '蒲', '蒼', '蓉', '蓑', '蓬', '蓮', '蔓', '蔣', '蔦', '蔭', '蕃', '蕉', '蕎', '蕗', '蕨', '蕪', '蕾', '薙', '薩', '藁', '蘇', '蘭', '蝦', '蝶', '螺', '蟬', '蟹', '蠟', '衿', '袈', '袴', '裟', '裡', '裳', '襖', '訊', '訣', '註', '詢', '詫', '誼', '諄', '諏', '諒', '諺', '謂', '讃', '豹', '貰', '賑', '赳', '跨', '蹄', '蹟', '輔', '輯', '輿', '轟', '辰', '辻', '辿', '迂', '迄', '迦', '迪', '逗', '這', '逞', '逢', '遁', '遙', '遥', '遼', '邑', '郁', '鄭', '酉', '醇', '醍', '醐', '醬', '釉', '釘', '釧', '銑', '鋒', '鋸', '錆', '錐', '錘', '錫', '鍬', '鎧', '閃', '閏', '閤', '阿', '陀', '隈', '隼', '雀', '雁', '雛', '雫', '霞', '靖', '鞄', '鞍', '鞘', '鞠', '鞭', '頁', '頌', '頗', '顚', '颯', '饗', '馨', '馳', '馴', '駕', '駿', '驍', '魁', '魯', '鮎', '鯉', '鯛', '鰯', '鱒', '鱗', '鳩', '鳳', '鳶', '鴨', '鴻', '鵜', '鵬', '鷗', '鷲', '鷹', '鷺', '麒', '麟', '麿', '黎', '黛', '鼎', '猪', '渚', '琢', '祐', '禎' },
            new char [] { '乘', '亞', '佛', '來', '傳', '僞', '價', '儉', '兒', '冨', '凉', '剩', '劍', '勳', '卷', '卽', '單', '嚴', '圈', '國', '圓', '團', '埜', '增', '壘', '壞', '壯', '壽', '奧', '奬', '孃', '寢', '實', '寬', '將', '專', '峯', '峽', '嶋', '巢', '帶', '廣', '廳', '彈', '彌', '從', '徵', '德', '恆', '惠', '惡', '愼', '應', '懷', '戰', '戲', '拂', '拔', '拜', '揭', '搖', '搜', '擊', '攝', '收', '敍', '晚', '晝', '曆', '曉', '曾', '條', '榮', '樂', '樣', '橫', '檢', '櫻', '步', '歷', '每', '氣', '涉', '淚', '淨', '渴', '溫', '滯', '澁', '濕', '瀧', '瀨', '燈', '燒', '爭', '爲', '狀', '狹', '獸', '疊', '瘦', '盃', '盜', '盡', '眞', '碎', '祕', '禪', '禮', '稻', '穗', '粹', '綠', '緖', '緣', '縣', '縱', '纖', '聽', '臟', '與', '莊', '萬', '薗', '薰', '藏', '藝', '藥', '虛', '衞', '裝', '覽', '謠', '讓', '賣', '賴', '轉', '郞', '醉', '釀', '錄', '鍊', '鎭', '鑄', '陷', '險', '雜', '靜', '顯', '飜', '駈', '騷', '驗', '髮', '鷄', '黃', '黑', '默', '齊', '龍', '欄', '廊', '朗', '虜', '類', '神', '祥', '福', '諸', '都', '侮', '僧', '勉', '勤', '卑', '嘆', '器', '墨', '層', '悔', '憎', '懲', '敏', '暑', '梅', '海', '漢', '煮', '碑', '社', '祉', '祈', '祖', '祝', '禍', '穀', '突', '節', '練', '繁', '署', '者', '臭', '著', '視', '謁', '謹', '賓', '贈', '逸', '難', '響' }
        };
    }
}
