using System;
using System.Collections.Generic;
using System.Globalization;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Nekote
{
    // Cultures ディレクトリーの最初のクラスなので、共通的なコメントをここに書いておく

    // Cultures ディレクトリーは、ローカライゼーションのうち、主に文字列に関することを扱うクラスを含む
    // 日時の文字列化もこのディレクトリーだが、時差は文字列が関わらないため他のところで

    // ローカルエンコーディングも、Cultures ディレクトリーでは扱われない
    // 国や地域とのゆるい相関があるが、たとえばヨーロッパの言語のローカルエンコーディングは多数の国で使えるなど、一対一の関係とはほど遠い
    // ローカルエンコーディングは、既に、Unicode を基本とする文字列処理からの派生的かつ代替的な表現方法という位置付けになっている
    // どちらかと言えば、「文字列処理」のカテゴリーに属するもの

    // Exceptions ディレクトリーと同様、それぞれのクラス名に接尾辞として Culture を付ける
    // Localization ディレクトリーに *Locale も考えたが、
    //     クラス名の前半が第一に represent するのは CultureInfo なので、culture が主体のクラスと考えるべき

    // nCulture を静的でないクラスとして作り、静的プロパティーの nCulture.JaJp などを用意する選択肢もある
    // その方が、CultureInfo.GetCultures から Select でゴソッと作ったり、キーや添え字でのアクセスを可能にしたりできる
    // しかし、自分が Cultures ディレクトリーにより行いたいのは、むしろ、カルチャーごとの、共通化しにくいコードを整理していくこと
    // たとえば ja-JP では、「この文章は、中学生や各学年の小学生にとって難しくないか」の判別のため、常用漢字のリストを取得できるようにしたい
    // もちろんウェブシステムなどには、RightToLeft も勘案されての、最大公約数的な、どのカルチャーであってもユーザーエクスペリエンスが大きく損なわれない設計が必要
    // しかし、ローカルのアプリケーションにおいては、自分や関係者が習熟しているカルチャーに特化した作り込みも必要になる
    // Cultures ディレクトリーは、そういうコードのためのもの
    // CultureInfo.GetCultures が返すというだけで、全く無知のカルチャーも一応は揃えるところでない
    // シンプルに「カルチャー特有のコードを、Nekote の他の部分とは疎結合で整理していくところ」と認識するのが良いだろう
    // その点において、「Nekote の中核的なコードは n*Culture に一切依存しない」というのが、守るべきルール

    // 日本語には、ja のみと ja-JP の二つがある
    // 日本語に JP 以外が今後生じる可能性は低いため、nJaCulture を作った方が英語も（まずは）nEnCulture で足りるかもしれないと考えたが、
    //     最初から .NET と全く同じように細分化させた上で各部にフォールバックの仕組みを用意する方が、あとで詰まりにくいだろう

    // .NET では、ja のみのようなカルチャーは neutral culture とされるようだ
    // neutral culture での comparer などの生成は非推奨
    // To display and sort data, specify both the language and region ともある

    // CultureInfo Class (System.Globalization) | Microsoft Learn
    // https://learn.microsoft.com/en-us/dotnet/api/system.globalization.cultureinfo

    // CultureInfo.cs
    // https://source.dot.net/#System.Private.CoreLib/src/libraries/System.Private.CoreLib/src/System/Globalization/CultureInfo.cs

    public static class nJaJpCulture
    {
        private static CultureInfo? mCulture;

        public static CultureInfo Culture
        {
            get
            {
                // CultureInfo のインスタンスを得る方法は二つある
                // GetCultureInfo については、
                //     The GetCultureInfo method retrieves a cached, read-only CultureInfo object
                //     It offers better performance than a corresponding call to the CultureInfo.CultureInfo(String) constructor とある
                // コンストラクターの方は、
                //     Initializes a new instance of the CultureInfo class based on the culture specified by name
                //     and on a value that specifies whether to use the user-selected culture settings from Windows とのことで、
                //     Windows にログインしている現在のユーザーが Windows の設定をいじっていれば、それを引き継ぐこともできるようだ
                // n*Culture は、習熟のあるメジャーなカルチャーについて、特有のコードを扱ったり、最善の comparer を取得したりのためのもの
                // システムに登録されているカルチャーをそのまま使いたいため、GetCultureInfo の使用が適する

                // CultureInfo.GetCultureInfo Method (System.Globalization) | Microsoft Learn
                // https://learn.microsoft.com/en-us/dotnet/api/system.globalization.cultureinfo.getcultureinfo

                // CultureInfo Constructor (System.Globalization) | Microsoft Learn
                // https://learn.microsoft.com/en-us/dotnet/api/system.globalization.cultureinfo.-ctor

                // Windows の設定に影響を受けるというのがピンとこなかったので、もう少し調べた
                // CultureInfo.UseUserOverride が false になっていれば、とりあえず大丈夫そう

                // c# - How to detect if CurrentCulture has been customised by the user? - Stack Overflow
                // https://stackoverflow.com/questions/21280754/how-to-detect-if-currentculture-has-been-customised-by-the-user

                // CultureInfo のプロパティーとして得られるものは、InvariantCulture 以外、null あるいは影響あり

                // Console.WriteLine (CultureInfo.CurrentCulture.UseUserOverride); // True
                // Console.WriteLine (CultureInfo.CurrentUICulture.UseUserOverride); // True
                // Console.WriteLine (CultureInfo.DefaultThreadCurrentCulture?.UseUserOverride == null); // True
                // Console.WriteLine (CultureInfo.DefaultThreadCurrentUICulture?.UseUserOverride == null); // True
                // Console.WriteLine (CultureInfo.InstalledUICulture.UseUserOverride); // True
                // Console.WriteLine (CultureInfo.InvariantCulture.UseUserOverride); // False

                // CultureInfo.GetCultureInfo で取得したものは大丈夫
                // Console.WriteLine (nJaJpCulture.Culture.UseUserOverride); // False

                // ja でなく ja-JP として一致していること、その上で UseUserOverride のみ異なることの確認

                // Console.WriteLine (CultureInfo.GetCultureInfo ("ja").LCID); // 17
                // Console.WriteLine (CultureInfo.CurrentCulture.LCID); // 1041
                // Console.WriteLine (nJaJpCulture.Culture.LCID); // 1041

                if (mCulture == null)
                    mCulture = CultureInfo.GetCultureInfo ("ja-JP", predefinedOnly: true);

                return mCulture;
            }
        }

        // CaseSensitiveComparer なども考えたが、.NET 的な命名に
        // In が入っているかどうかで見分けるより分かりやすい

        private static StringComparer? mComparer;

        public static StringComparer Comparer
        {
            get
            {
                if (mComparer == null)
                    mComparer = StringComparer.Create (Culture, ignoreCase: false);

                return mComparer;
            }
        }

        private static StringComparer? mComparerIgnoreCase;

        public static StringComparer ComparerIgnoreCase
        {
            get
            {
                if (mComparerIgnoreCase == null)
                    mComparerIgnoreCase = StringComparer.Create (Culture, ignoreCase: true);

                return mComparerIgnoreCase;
            }
        }

        // nAlphanumericComparer クラスの、カルチャー関係なしのインスタンスはプログラムの起動と同時に初期化されるが、こちらのものは JIT 的に
        // StringComparer.Create のコストが気になるし、特定のカルチャーの alphanumeric comparer は、よく使われるわけでもない

        private static nAlphanumericComparer? mComparerAlphanumeric;

        public static nAlphanumericComparer ComparerAlphanumeric
        {
            get
            {
                if (mComparerAlphanumeric == null)
                    mComparerAlphanumeric = new nAlphanumericComparer (Comparer);

                return mComparerAlphanumeric;
            }
        }

        private static nAlphanumericComparer? mComparerAlphanumericIgnoreCase;

        public static nAlphanumericComparer ComparerAlphanumericIgnoreCase
        {
            get
            {
                if (mComparerAlphanumericIgnoreCase == null)
                    mComparerAlphanumericIgnoreCase = new nAlphanumericComparer (ComparerIgnoreCase);

                return mComparerAlphanumericIgnoreCase;
            }
        }

        // Jōyō kanji - Wikipedia
        // https://en.wikipedia.org/wiki/J%C5%8Dy%C5%8D_kanji

        public static readonly char [] JoyoKanji = { '亜', '哀', '愛', '挨', '悪', '握', '圧', '扱', '宛', '安', '暗', '案', '闇', '以', '位', '依', '偉', '囲', '委', '威', '尉', '意', '慰', '易', '椅', '為', '畏', '異', '移', '維', '緯', '胃', '萎', '衣', '違', '遺', '医', '井', '域', '育', '一', '壱', '逸', '稲', '茨', '芋', '印', '咽', '員', '因', '姻', '引', '飲', '淫', '院', '陰', '隠', '韻', '右', '宇', '羽', '雨', '臼', '渦', '唄', '浦', '運', '雲', '餌', '営', '影', '映', '栄', '永', '泳', '英', '衛', '詠', '鋭', '液', '疫', '益', '駅', '悦', '謁', '越', '閲', '円', '園', '宴', '延', '怨', '援', '沿', '演', '炎', '煙', '猿', '縁', '艶', '遠', '鉛', '塩', '汚', '凹', '央', '奥', '往', '応', '押', '旺', '横', '欧', '殴', '王', '翁', '黄', '岡', '沖', '億', '屋', '憶', '臆', '乙', '俺', '卸', '恩', '温', '穏', '音', '下', '化', '仮', '何', '価', '佳', '加', '可', '夏', '嫁', '家', '寡', '科', '暇', '果', '架', '歌', '河', '火', '禍', '稼', '箇', '花', '苛', '荷', '華', '菓', '課', '貨', '過', '蚊', '我', '牙', '画', '芽', '賀', '雅', '餓', '介', '会', '解', '回', '塊', '壊', '快', '怪', '悔', '懐', '戒', '拐', '改', '械', '海', '灰', '界', '皆', '絵', '開', '階', '貝', '劾', '外', '害', '崖', '慨', '概', '涯', '蓋', '街', '該', '骸', '垣', '柿', '嚇', '各', '拡', '格', '核', '殻', '獲', '確', '穫', '覚', '角', '較', '郭', '閣', '隔', '革', '学', '岳', '楽', '額', '顎', '掛', '潟', '割', '喝', '括', '活', '渇', '滑', '葛', '褐', '轄', '且', '株', '釜', '鎌', '刈', '瓦', '乾', '冠', '寒', '刊', '勘', '勧', '巻', '喚', '堪', '完', '官', '寛', '干', '幹', '患', '感', '慣', '憾', '換', '敢', '棺', '款', '歓', '汗', '漢', '環', '甘', '監', '看', '管', '簡', '緩', '缶', '肝', '艦', '観', '貫', '還', '鑑', '間', '閑', '関', '陥', '韓', '館', '丸', '含', '岸', '玩', '眼', '岩', '頑', '顔', '願', '企', '伎', '危', '喜', '器', '基', '奇', '寄', '岐', '希', '幾', '忌', '揮', '机', '旗', '既', '期', '棋', '棄', '機', '帰', '気', '汽', '畿', '祈', '季', '紀', '規', '記', '貴', '起', '軌', '輝', '飢', '騎', '鬼', '亀', '偽', '儀', '宜', '戯', '技', '擬', '欺', '犠', '疑', '義', '議', '菊', '吉', '喫', '詰', '却', '客', '脚', '虐', '逆', '丘', '久', '休', '及', '吸', '宮', '弓', '急', '救', '朽', '求', '泣', '球', '究', '窮', '級', '糾', '給', '旧', '牛', '去', '居', '巨', '拒', '拠', '挙', '虚', '許', '距', '漁', '魚', '享', '京', '供', '競', '共', '凶', '協', '叫', '境', '峡', '強', '恐', '恭', '挟', '教', '橋', '況', '狂', '狭', '矯', '胸', '脅', '興', '郷', '鏡', '響', '驚', '仰', '凝', '暁', '業', '局', '曲', '極', '玉', '僅', '勤', '均', '巾', '錦', '斤', '琴', '禁', '筋', '緊', '菌', '襟', '謹', '近', '金', '吟', '銀', '九', '句', '区', '苦', '駆', '駒', '具', '愚', '虞', '空', '偶', '遇', '隅', '串', '屈', '掘', '窟', '靴', '熊', '繰', '桑', '勲', '君', '薫', '訓', '群', '軍', '郡', '係', '傾', '刑', '兄', '啓', '型', '契', '形', '径', '恵', '慶', '憩', '掲', '携', '敬', '景', '渓', '稽', '系', '経', '継', '茎', '蛍', '計', '詣', '警', '軽', '鶏', '芸', '迎', '鯨', '劇', '撃', '激', '隙', '桁', '傑', '欠', '決', '潔', '穴', '結', '血', '月', '件', '倹', '健', '兼', '券', '剣', '圏', '堅', '嫌', '建', '憲', '懸', '拳', '検', '権', '犬', '献', '研', '絹', '県', '肩', '見', '謙', '賢', '軒', '遣', '鍵', '険', '顕', '験', '元', '原', '厳', '幻', '弦', '減', '源', '玄', '現', '舷', '言', '限', '個', '古', '呼', '固', '孤', '己', '庫', '弧', '戸', '故', '枯', '湖', '股', '虎', '誇', '雇', '顧', '鼓', '五', '互', '午', '呉', '娯', '後', '御', '悟', '碁', '語', '誤', '護', '乞', '交', '侯', '候', '光', '公', '功', '効', '勾', '厚', '口', '向', '后', '喉', '坑', '好', '孔', '孝', '工', '巧', '幸', '広', '康', '恒', '慌', '抗', '拘', '控', '攻', '更', '校', '梗', '構', '江', '洪', '港', '溝', '甲', '皇', '硬', '稿', '紅', '絞', '綱', '耕', '考', '肯', '航', '荒', '行', '衡', '講', '貢', '購', '郊', '酵', '鉱', '鋼', '降', '項', '香', '高', '剛', '号', '合', '拷', '豪', '克', '刻', '告', '国', '穀', '酷', '黒', '獄', '腰', '骨', '込', '頃', '今', '困', '墾', '婚', '恨', '懇', '昆', '根', '混', '痕', '紺', '魂', '佐', '唆', '左', '差', '査', '沙', '砂', '詐', '鎖', '座', '挫', '債', '催', '再', '最', '塞', '妻', '宰', '彩', '才', '採', '栽', '歳', '済', '災', '采', '砕', '祭', '斎', '細', '菜', '裁', '載', '際', '剤', '在', '材', '罪', '財', '坂', '阪', '咲', '崎', '埼', '作', '削', '搾', '昨', '柵', '策', '索', '錯', '桜', '冊', '刷', '察', '拶', '撮', '擦', '札', '殺', '雑', '皿', '三', '傘', '参', '山', '惨', '散', '桟', '産', '算', '蚕', '賛', '酸', '斬', '暫', '残', '仕', '伺', '使', '刺', '司', '史', '嗣', '四', '士', '始', '姉', '姿', '子', '市', '師', '志', '思', '指', '支', '施', '旨', '枝', '止', '死', '氏', '祉', '私', '糸', '紙', '紫', '肢', '脂', '至', '視', '詞', '詩', '試', '誌', '諮', '資', '賜', '雌', '飼', '歯', '事', '似', '侍', '児', '字', '寺', '慈', '持', '時', '次', '滋', '治', '璽', '磁', '示', '耳', '自', '辞', '鹿', '式', '識', '軸', '七', '叱', '執', '失', '嫉', '室', '湿', '漆', '疾', '質', '実', '芝', '舎', '写', '射', '捨', '赦', '斜', '煮', '社', '者', '謝', '車', '遮', '蛇', '邪', '借', '尺', '爵', '酌', '釈', '若', '寂', '弱', '主', '取', '守', '手', '朱', '殊', '狩', '珠', '種', '腫', '趣', '酒', '首', '儒', '受', '呪', '寿', '授', '樹', '需', '囚', '収', '周', '宗', '就', '州', '修', '愁', '拾', '秀', '秋', '終', '習', '臭', '舟', '衆', '襲', '蹴', '週', '酬', '集', '醜', '住', '充', '十', '従', '柔', '汁', '渋', '獣', '縦', '重', '銃', '叔', '宿', '淑', '祝', '縮', '粛', '塾', '熟', '出', '術', '述', '俊', '春', '瞬', '准', '循', '旬', '殉', '準', '潤', '盾', '純', '巡', '遵', '順', '処', '初', '所', '暑', '庶', '緒', '署', '書', '諸', '助', '叙', '女', '序', '徐', '除', '傷', '償', '勝', '匠', '升', '召', '商', '唱', '奨', '宵', '将', '小', '少', '尚', '床', '彰', '承', '抄', '招', '掌', '昇', '昭', '晶', '松', '沼', '消', '渉', '焼', '焦', '照', '症', '省', '硝', '礁', '祥', '称', '章', '笑', '粧', '紹', '肖', '衝', '訟', '証', '詔', '詳', '象', '賞', '鐘', '障', '上', '丈', '乗', '冗', '剰', '城', '場', '壌', '嬢', '常', '情', '条', '浄', '状', '畳', '蒸', '譲', '醸', '錠', '嘱', '飾', '拭', '植', '殖', '織', '職', '色', '触', '食', '辱', '尻', '伸', '信', '侵', '唇', '娠', '寝', '審', '心', '慎', '振', '新', '森', '浸', '深', '申', '真', '神', '紳', '臣', '芯', '薪', '親', '診', '身', '辛', '進', '針', '震', '人', '仁', '刃', '尋', '甚', '尽', '腎', '迅', '陣', '須', '酢', '図', '吹', '垂', '帥', '推', '水', '炊', '睡', '粋', '衰', '遂', '酔', '随', '髄', '崇', '数', '枢', '据', '杉', '裾', '澄', '寸', '世', '瀬', '畝', '是', '凄', '制', '勢', '姓', '征', '性', '成', '政', '整', '星', '晴', '正', '清', '牲', '生', '盛', '精', '聖', '声', '製', '西', '誠', '誓', '請', '逝', '醒', '青', '静', '斉', '税', '隻', '席', '惜', '戚', '斥', '昔', '析', '石', '積', '籍', '績', '脊', '責', '赤', '跡', '切', '拙', '接', '摂', '折', '設', '窃', '節', '説', '雪', '絶', '舌', '仙', '先', '千', '占', '宣', '専', '川', '戦', '扇', '栓', '泉', '浅', '洗', '染', '潜', '煎', '旋', '線', '繊', '羨', '腺', '船', '薦', '詮', '践', '選', '遷', '銭', '鮮', '前', '善', '漸', '然', '全', '禅', '繕', '膳', '塑', '措', '曽', '狙', '疎', '礎', '祖', '租', '粗', '素', '組', '訴', '阻', '遡', '僧', '創', '双', '倉', '喪', '壮', '奏', '爽', '層', '想', '捜', '掃', '挿', '操', '早', '曹', '巣', '槽', '燥', '争', '痩', '相', '窓', '総', '草', '荘', '葬', '藻', '装', '走', '送', '遭', '霜', '騒', '像', '増', '憎', '臓', '蔵', '贈', '造', '促', '側', '則', '即', '息', '捉', '束', '測', '足', '速', '俗', '属', '賊', '族', '続', '卒', '袖', '存', '孫', '尊', '損', '村', '遜', '他', '多', '太', '汰', '唾', '堕', '妥', '惰', '打', '駄', '体', '堆', '対', '耐', '帯', '待', '怠', '態', '戴', '替', '泰', '滞', '胎', '袋', '貸', '退', '逮', '隊', '代', '台', '大', '第', '題', '滝', '卓', '宅', '択', '拓', '沢', '濯', '託', '濁', '諾', '但', '達', '奪', '脱', '棚', '谷', '誰', '丹', '単', '嘆', '担', '探', '旦', '淡', '炭', '短', '端', '綻', '胆', '誕', '鍛', '団', '壇', '弾', '断', '暖', '段', '男', '談', '値', '知', '地', '恥', '池', '痴', '稚', '置', '致', '遅', '築', '畜', '竹', '蓄', '逐', '秩', '窒', '茶', '嫡', '着', '中', '仲', '宙', '忠', '抽', '昼', '柱', '注', '虫', '衷', '酎', '鋳', '駐', '著', '貯', '丁', '兆', '帳', '庁', '弔', '張', '彫', '徴', '懲', '挑', '朝', '潮', '町', '眺', '聴', '腸', '調', '超', '跳', '長', '頂', '鳥', '勅', '捗', '直', '朕', '沈', '珍', '賃', '鎮', '陳', '津', '墜', '椎', '追', '痛', '通', '塚', '漬', '潰', '坪', '爪', '釣', '鶴', '亭', '低', '停', '偵', '貞', '呈', '堤', '定', '帝', '底', '庭', '廷', '弟', '抵', '提', '程', '締', '艇', '訂', '諦', '逓', '邸', '泥', '摘', '敵', '滴', '的', '笛', '適', '溺', '哲', '徹', '撤', '迭', '鉄', '典', '填', '天', '展', '店', '添', '貼', '転', '点', '伝', '殿', '田', '電', '吐', '塗', '妬', '徒', '斗', '渡', '登', '賭', '途', '都', '努', '度', '土', '奴', '怒', '倒', '党', '冬', '凍', '刀', '唐', '塔', '島', '悼', '投', '搭', '東', '桃', '棟', '盗', '湯', '灯', '当', '痘', '等', '答', '筒', '糖', '統', '到', '藤', '討', '謄', '豆', '踏', '逃', '透', '陶', '頭', '騰', '闘', '働', '動', '同', '堂', '導', '憧', '洞', '瞳', '童', '胴', '道', '銅', '峠', '匿', '得', '徳', '特', '督', '篤', '毒', '独', '読', '栃', '凸', '突', '届', '屯', '豚', '頓', '曇', '鈍', '奈', '那', '内', '謎', '鍋', '縄', '南', '軟', '難', '二', '尼', '弐', '匂', '肉', '虹', '日', '乳', '入', '如', '尿', '任', '妊', '忍', '認', '寧', '猫', '熱', '年', '念', '捻', '燃', '粘', '悩', '濃', '納', '能', '脳', '農', '把', '覇', '波', '派', '破', '婆', '罵', '馬', '俳', '廃', '拝', '排', '敗', '杯', '背', '肺', '輩', '配', '倍', '培', '媒', '梅', '買', '売', '賠', '陪', '伯', '剥', '博', '拍', '泊', '白', '舶', '薄', '迫', '漠', '爆', '縛', '麦', '箱', '箸', '肌', '畑', '八', '鉢', '発', '髪', '伐', '罰', '抜', '閥', '伴', '判', '半', '反', '帆', '搬', '斑', '板', '氾', '汎', '版', '犯', '班', '畔', '繁', '般', '藩', '販', '範', '煩', '頒', '飯', '晩', '番', '盤', '蛮', '卑', '否', '妃', '彼', '悲', '扉', '批', '披', '比', '泌', '疲', '皮', '碑', '秘', '罷', '肥', '被', '費', '避', '非', '飛', '備', '尾', '微', '眉', '美', '鼻', '匹', '膝', '肘', '必', '筆', '姫', '媛', '百', '俵', '標', '氷', '漂', '票', '表', '評', '描', '病', '秒', '苗', '品', '浜', '貧', '賓', '頻', '敏', '瓶', '不', '付', '夫', '婦', '富', '布', '府', '怖', '扶', '敷', '普', '浮', '父', '符', '腐', '膚', '譜', '負', '賦', '赴', '阜', '附', '侮', '武', '舞', '部', '封', '風', '伏', '副', '復', '幅', '服', '福', '腹', '複', '覆', '払', '沸', '仏', '物', '分', '噴', '墳', '憤', '奮', '粉', '紛', '雰', '文', '聞', '丙', '併', '兵', '塀', '幣', '平', '弊', '柄', '並', '蔽', '閉', '陛', '米', '壁', '癖', '別', '蔑', '偏', '変', '片', '編', '辺', '返', '遍', '便', '勉', '弁', '保', '舗', '捕', '歩', '補', '穂', '募', '墓', '慕', '暮', '母', '簿', '倣', '俸', '包', '報', '奉', '宝', '峰', '崩', '抱', '放', '方', '法', '泡', '砲', '縫', '胞', '芳', '蜂', '褒', '訪', '豊', '邦', '飽', '乏', '亡', '傍', '剖', '坊', '妨', '帽', '忘', '忙', '房', '暴', '望', '某', '棒', '冒', '紡', '肪', '膨', '謀', '貌', '貿', '防', '頬', '北', '僕', '墨', '撲', '朴', '牧', '睦', '勃', '没', '堀', '奔', '本', '翻', '凡', '盆', '摩', '磨', '魔', '麻', '埋', '妹', '昧', '枚', '毎', '幕', '膜', '枕', '又', '抹', '末', '繭', '万', '慢', '満', '漫', '味', '未', '魅', '岬', '密', '蜜', '脈', '妙', '民', '眠', '務', '夢', '無', '矛', '霧', '婿', '娘', '冥', '名', '命', '明', '盟', '迷', '銘', '鳴', '滅', '免', '綿', '面', '麺', '模', '茂', '妄', '毛', '猛', '盲', '網', '耗', '木', '黙', '目', '餅', '戻', '問', '紋', '門', '冶', '夜', '野', '弥', '矢', '厄', '役', '約', '薬', '訳', '躍', '柳', '愉', '油', '癒', '諭', '輸', '唯', '優', '勇', '友', '幽', '悠', '憂', '有', '湧', '猶', '由', '裕', '誘', '遊', '郵', '雄', '融', '夕', '予', '余', '与', '誉', '預', '幼', '妖', '容', '庸', '揚', '揺', '擁', '曜', '様', '洋', '溶', '用', '窯', '羊', '葉', '要', '謡', '踊', '陽', '養', '抑', '欲', '沃', '浴', '翌', '翼', '羅', '裸', '来', '頼', '雷', '絡', '落', '酪', '乱', '卵', '嵐', '欄', '濫', '藍', '覧', '利', '吏', '履', '梨', '理', '璃', '痢', '裏', '里', '離', '陸', '律', '率', '立', '略', '流', '留', '硫', '粒', '隆', '竜', '侶', '慮', '旅', '虜', '了', '僚', '両', '寮', '料', '涼', '猟', '療', '瞭', '糧', '良', '量', '陵', '領', '力', '緑', '倫', '厘', '林', '臨', '輪', '隣', '瑠', '塁', '涙', '累', '類', '令', '例', '冷', '励', '礼', '鈴', '隷', '零', '霊', '麗', '齢', '暦', '歴', '列', '劣', '烈', '裂', '廉', '恋', '練', '連', '錬', '呂', '炉', '賂', '路', '露', '労', '廊', '弄', '朗', '楼', '浪', '漏', '老', '郎', '六', '麓', '録', '論', '和', '話', '賄', '脇', '惑', '枠', '湾', '腕', '丼', '傲', '刹', '哺', '喩', '嗅', '嘲', '毀', '彙', '恣', '惧', '慄', '憬', '拉', '摯', '曖', '楷', '鬱', '璧', '瘍', '箋', '籠', '緻', '羞', '訃', '諧', '貪', '踪', '辣', '錮' };

        // 常用漢字には、現時点で4文字、JIS X 0208 に収まらないが、より正確な字体とされるものがある
        // そのうち一つは Unicode の BMP 面にも収まらず、サロゲートペアでないと扱えない
        // いずれも BMP 面には収まるなら置換しないが、1文字だけ char でさえないと扱いに困るので四つとも置換

        // 次のページには、The "New" column attempts to reflect the official glyph shapes as closely as possible
        //     This requires using the characters 𠮟, 塡, 剝, 頰 which are outside of Japan's basic character set, JIS X 0208 (one of them is also outside the Unicode BMP)
        //     In practice, these characters are usually replaced by the characters 叱, 填, 剥, 頬, which are present in JIS X 0208 とある

        // List of jōyō kanji - Wikipedia
        // https://en.wikipedia.org/wiki/List_of_j%C5%8Dy%C5%8D_kanji

        // uint で考えていたが、.NET のメソッドは int なので、それにならう

        // Char.ConvertFromUtf32(Int32) Method (System) | Microsoft Learn
        // https://learn.microsoft.com/en-us/dotnet/api/system.char.convertfromutf32

        public static readonly int [,] JoyoKanjiAlt = new int [,]
        {
            { '叱', 0x20B9F }, // 𠮟
            { '填', '塡' },
            { '剥', '剝' },
            { '頬', '頰' }
        };

        public static bool IsJoyoKanji (char value)
        {
            return MemoryExtensions.Contains (JoyoKanji, value);
        }

        // char なので、Nullable にした方が、値があるかどうかのチェックがコストに

        public static bool IsJoyoKanjiOrAlt (char value, char nextValue = default)
        {
            if (MemoryExtensions.Contains (JoyoKanji, value))
                return true;

            int xLength = JoyoKanjiAlt.GetLength (0);

            for (int temp = 0; temp < xLength; temp ++)
            {
                int xValue = JoyoKanjiAlt [temp, 1];

                if (xValue <= 0xFFFF)
                {
                    if ((char) xValue == value)
                        return true;
                }

                else
                {
                    // 前後の値の範囲がチェックされる可能性があるため事前に
                    if (char.IsHighSurrogate (value) && char.IsLowSurrogate (nextValue))
                    {
                        if (char.ConvertToUtf32 (value, nextValue) == xValue)
                            return true;
                    }
                }
            }

            return false;
        }

        // 厳密には「教育漢字」は1～6年生までの1026文字に限られるようだが、
        //     分かりやすいので、中学（以降？）のものも含めてフィールド名に採用
        // 中学（以降？）も同じ配列に入れるのは、ループや LINQ での処理を想定してのこと → 後述する理由により、やめておく
        // 常用漢字から1～6年生の漢字を引けば得られるが、わずかなデータなので初めから用意しておく

        // 教育漢字 - Wikipedia
        // https://ja.wikipedia.org/wiki/%E6%95%99%E8%82%B2%E6%BC%A2%E5%AD%97

        // Kyōiku kanji - Wikipedia
        // https://en.wikipedia.org/wiki/Ky%C5%8Diku_kanji

        // 中学（以降？）の漢字の除外について

        // 最初は入れたが、フィールド名との不整合、データとして重複になること、JoyoKanjiAlt の漢字が含まれることにより除外した
        // そのうち最後の問題が大きい
        // GetKyoikuKanjiGrade を呼ぶ意図は、たいてい「小学○年生に読めるか」のチェック
        // 「中学生に読めるか」を調べたいなら、学年の判別は不要で、IsJoyoKanji* を呼べば足りる

        // 唯一気になるのは、小1～6、中学、それ以降の三つのいずれであるかを一発で判別できなくなること
        // 小1～6ではないと分かってから、では中学なのかと調べるにおいて、IsJoyoKanji* が小1～6の漢字との照合を行うのは無駄な処理

        // 常用漢字でないと分かっている1億文字を常用漢字のリストから探す所要時間は10秒
        // 文庫本の文字数は、ページにもよるが、10万字くらいのようだ
        // 文庫本1冊の全ての文字を常用漢字のリストで探せば、ほとんどの文字は途中で見付かり、1冊10ミリ秒を大きく下回る
        // JoyoKanjiAlt の方も見るなどによりコストが増大しても、ユーザーエクスペリエンスを落とすほどでない

        // Stopwatch xStopwatch = new Stopwatch ();

        // xStopwatch.Start ();

        // for (int temp = 0; temp < 100_000_000; temp ++)
        //     MemoryExtensions.Contains (nJaJpCulture.JoyoKanji, '_');

        // Console.WriteLine ($"{xStopwatch.ElapsedMilliseconds}ms"); // → 9551ms

        public static readonly char [][] KyoikuKanji =
        {
            new char [] { '一', '右', '雨', '円', '王', '音', '下', '火', '花', '貝', '学', '気', '休', '玉', '金', '九', '空', '月', '犬', '見', '五', '口', '校', '左', '三', '山', '四', '子', '糸', '字', '耳', '七', '車', '手', '十', '出', '女', '小', '上', '森', '人', '水', '正', '生', '青', '石', '赤', '先', '千', '川', '早', '草', '足', '村', '大', '男', '竹', '中', '虫', '町', '天', '田', '土', '二', '日', '入', '年', '白', '八', '百', '文', '本', '名', '木', '目', '夕', '立', '力', '林', '六' },
            new char [] { '引', '羽', '雲', '園', '遠', '黄', '何', '夏', '家', '科', '歌', '画', '会', '回', '海', '絵', '外', '角', '楽', '活', '間', '丸', '岩', '顔', '帰', '汽', '記', '弓', '牛', '魚', '京', '強', '教', '近', '兄', '形', '計', '元', '原', '言', '古', '戸', '午', '後', '語', '交', '光', '公', '工', '広', '考', '行', '高', '合', '国', '黒', '今', '才', '細', '作', '算', '姉', '市', '思', '止', '紙', '寺', '時', '自', '室', '社', '弱', '首', '秋', '週', '春', '書', '少', '場', '色', '食', '心', '新', '親', '図', '数', '星', '晴', '声', '西', '切', '雪', '線', '船', '前', '組', '走', '多', '太', '体', '台', '谷', '知', '地', '池', '茶', '昼', '朝', '長', '鳥', '直', '通', '弟', '店', '点', '電', '冬', '刀', '東', '当', '答', '頭', '同', '道', '読', '内', '南', '肉', '馬', '買', '売', '麦', '半', '番', '父', '風', '分', '聞', '米', '歩', '母', '方', '北', '妹', '毎', '万', '明', '鳴', '毛', '門', '夜', '野', '矢', '友', '曜', '用', '来', '理', '里', '話' },
            new char [] { '悪', '安', '暗', '委', '意', '医', '育', '員', '飲', '院', '運', '泳', '駅', '央', '横', '屋', '温', '化', '荷', '界', '開', '階', '寒', '感', '漢', '館', '岸', '期', '起', '客', '宮', '急', '球', '究', '級', '去', '橋', '業', '局', '曲', '銀', '区', '苦', '具', '君', '係', '軽', '決', '血', '研', '県', '庫', '湖', '向', '幸', '港', '号', '根', '祭', '坂', '皿', '仕', '使', '始', '指', '死', '詩', '歯', '事', '持', '次', '式', '実', '写', '者', '主', '取', '守', '酒', '受', '州', '拾', '終', '習', '集', '住', '重', '宿', '所', '暑', '助', '勝', '商', '昭', '消', '章', '乗', '植', '深', '申', '真', '神', '身', '進', '世', '整', '昔', '全', '想', '相', '送', '息', '速', '族', '他', '打', '対', '待', '代', '第', '題', '炭', '短', '談', '着', '柱', '注', '丁', '帳', '調', '追', '定', '庭', '笛', '鉄', '転', '登', '都', '度', '島', '投', '湯', '等', '豆', '動', '童', '農', '波', '配', '倍', '箱', '畑', '発', '反', '板', '悲', '皮', '美', '鼻', '筆', '氷', '表', '病', '秒', '品', '負', '部', '服', '福', '物', '平', '返', '勉', '放', '味', '命', '面', '問', '役', '薬', '油', '有', '由', '遊', '予', '様', '洋', '羊', '葉', '陽', '落', '流', '旅', '両', '緑', '礼', '列', '練', '路', '和' },
            new char [] { '愛', '案', '以', '位', '囲', '胃', '衣', '印', '栄', '英', '塩', '億', '加', '果', '課', '貨', '芽', '改', '械', '害', '街', '各', '覚', '完', '官', '管', '観', '関', '願', '喜', '器', '希', '旗', '機', '季', '紀', '議', '救', '求', '泣', '給', '挙', '漁', '競', '共', '協', '鏡', '極', '訓', '軍', '郡', '型', '径', '景', '芸', '欠', '結', '健', '建', '験', '固', '候', '功', '好', '康', '航', '告', '差', '最', '菜', '材', '昨', '刷', '察', '札', '殺', '参', '散', '産', '残', '司', '史', '士', '氏', '試', '児', '治', '辞', '失', '借', '種', '周', '祝', '順', '初', '唱', '松', '焼', '照', '省', '笑', '象', '賞', '信', '臣', '成', '清', '静', '席', '積', '折', '節', '説', '戦', '浅', '選', '然', '倉', '巣', '争', '側', '束', '続', '卒', '孫', '帯', '隊', '達', '単', '置', '仲', '貯', '兆', '腸', '低', '停', '底', '的', '典', '伝', '徒', '努', '灯', '働', '堂', '得', '特', '毒', '熱', '念', '敗', '梅', '博', '飯', '費', '飛', '必', '標', '票', '不', '付', '夫', '府', '副', '粉', '兵', '別', '変', '辺', '便', '包', '法', '望', '牧', '末', '満', '未', '脈', '民', '無', '約', '勇', '要', '養', '浴', '利', '陸', '料', '良', '量', '輪', '類', '令', '例', '冷', '歴', '連', '労', '老', '録' },
            new char [] { '圧', '易', '移', '因', '営', '永', '衛', '液', '益', '演', '往', '応', '恩', '仮', '価', '可', '河', '過', '賀', '解', '快', '格', '確', '額', '刊', '幹', '慣', '眼', '基', '寄', '規', '技', '義', '逆', '久', '旧', '居', '許', '境', '興', '均', '禁', '句', '群', '経', '潔', '件', '券', '検', '険', '減', '現', '限', '個', '故', '護', '効', '厚', '構', '耕', '講', '鉱', '混', '査', '再', '妻', '採', '災', '際', '在', '罪', '財', '桜', '雑', '賛', '酸', '師', '志', '支', '枝', '資', '飼', '似', '示', '識', '質', '舎', '謝', '授', '修', '術', '述', '準', '序', '承', '招', '証', '常', '情', '条', '状', '織', '職', '制', '勢', '性', '政', '精', '製', '税', '績', '責', '接', '設', '絶', '舌', '銭', '祖', '素', '総', '像', '増', '造', '則', '測', '属', '損', '態', '貸', '退', '団', '断', '築', '張', '提', '程', '敵', '適', '統', '導', '銅', '徳', '独', '任', '燃', '能', '破', '判', '版', '犯', '比', '肥', '非', '備', '俵', '評', '貧', '婦', '富', '布', '武', '復', '複', '仏', '編', '弁', '保', '墓', '報', '豊', '暴', '貿', '防', '務', '夢', '迷', '綿', '輸', '余', '預', '容', '率', '略', '留', '領' },
            new char [] { '異', '遺', '域', '宇', '映', '延', '沿', '我', '灰', '拡', '閣', '革', '割', '株', '巻', '干', '看', '簡', '危', '揮', '机', '貴', '疑', '吸', '供', '胸', '郷', '勤', '筋', '敬', '系', '警', '劇', '激', '穴', '憲', '権', '絹', '厳', '源', '呼', '己', '誤', '后', '孝', '皇', '紅', '鋼', '降', '刻', '穀', '骨', '困', '砂', '座', '済', '裁', '策', '冊', '蚕', '姿', '私', '至', '視', '詞', '誌', '磁', '射', '捨', '尺', '若', '樹', '収', '宗', '就', '衆', '従', '縦', '縮', '熟', '純', '処', '署', '諸', '除', '傷', '将', '障', '城', '蒸', '針', '仁', '垂', '推', '寸', '盛', '聖', '誠', '宣', '専', '泉', '洗', '染', '善', '創', '奏', '層', '操', '窓', '装', '臓', '蔵', '存', '尊', '宅', '担', '探', '誕', '暖', '段', '値', '宙', '忠', '著', '庁', '潮', '頂', '賃', '痛', '展', '党', '糖', '討', '届', '難', '乳', '認', '納', '脳', '派', '俳', '拝', '背', '肺', '班', '晩', '否', '批', '秘', '腹', '奮', '並', '閉', '陛', '片', '補', '暮', '宝', '訪', '亡', '忘', '棒', '枚', '幕', '密', '盟', '模', '訳', '優', '郵', '幼', '欲', '翌', '乱', '卵', '覧', '裏', '律', '臨', '朗', '論' }
        };

        /// <summary>
        /// N 年生なら N - 1 が返る。小学校で習わないなら -1。
        /// </summary>
        public static int GetKyoikuKanjiGrade (char value)
        {
            for (int temp = 0; temp < KyoikuKanji.Length; temp ++)
            {
                if (MemoryExtensions.Contains (KyoikuKanji [temp], value))
                    return temp;
            }

            return -1;
        }

        // Jinmeiyō kanji - Wikipedia
        // https://en.wikipedia.org/wiki/Jinmeiy%C5%8D_kanji

        public static readonly char [][] JinmeiyoKanji =
        {
            new char [] { '娃', '阿', '逢', '葵', '茜', '渥', '旭', '葦', '芦', '梓', '斡', '絢', '綾', '鮎', '或', '粟', '庵', '按', '鞍', '杏', '伊', '夷', '惟', '謂', '亥', '郁', '磯', '溢', '鰯', '允', '胤', '蔭', '烏', '迂', '卯', '鵜', '窺', '丑', '碓', '姥', '厩', '瓜', '閏', '噂', '云', '叡', '曳', '瑛', '榎', '堰', '奄', '燕', '苑', '於', '甥', '襖', '荻', '桶', '牡', '伽', '嘉', '珂', '禾', '茄', '蝦', '嘩', '迦', '霞', '俄', '峨', '臥', '駕', '廻', '恢', '魁', '晦', '芥', '蟹', '凱', '鎧', '浬', '馨', '笠', '樫', '梶', '恰', '叶', '椛', '樺', '鞄', '兜', '蒲', '鴨', '茅', '萱', '粥', '侃', '柑', '竿', '莞', '巌', '雁', '嬉', '毅', '稀', '徽', '祇', '誼', '掬', '鞠', '桔', '橘', '砧', '杵', '汲', '灸', '笈', '鋸', '亨', '匡', '卿', '喬', '蕎', '饗', '尭', '桐', '欣', '欽', '禽', '芹', '衿', '玖', '矩', '喰', '寓', '櫛', '釧', '屑', '沓', '窪', '隈', '栗', '鍬', '袈', '祁', '圭', '慧', '桂', '戟', '訣', '倦', '喧', '捲', '牽', '硯', '絃', '諺', '乎', '糊', '袴', '胡', '跨', '伍', '吾', '梧', '檎', '瑚', '醐', '鯉', '倖', '宏', '巷', '庚', '弘', '昂', '晃', '杭', '浩', '紘', '腔', '膏', '閤', '鴻', '劫', '壕', '轟', '忽', '惚', '此', '昏', '些', '叉', '嵯', '瑳', '裟', '坐', '哉', '犀', '砦', '冴', '堺', '榊', '肴', '鷺', '朔', '窄', '笹', '薩', '皐', '錆', '晒', '撒', '燦', '珊', '纂', '讃', '仔', '孜', '斯', '獅', '爾', '而', '蒔', '汐', '竺', '雫', '悉', '篠', '偲', '柴', '縞', '紗', '勺', '灼', '錫', '惹', '洲', '蒐', '輯', '峻', '竣', '舜', '駿', '楯', '淳', '醇', '曙', '渚', '渚', '恕', '哨', '嘗', '庄', '捷', '昌', '梢', '樟', '湘', '菖', '蕉', '裳', '鞘', '丞', '杖', '穣', '埴', '燭', '晋', '榛', '秦', '壬', '訊', '諏', '厨', '逗', '翠', '錐', '錘', '瑞', '嵩', '雛', '菅', '頗', '雀', '摺', '棲', '栖', '蹟', '碩', '尖', '撰', '穿', '銑', '閃', '噌', '楚', '疏', '蘇', '叢', '宋', '惣', '槍', '漕', '綜', '聡', '蒼', '其', '揃', '舵', '楕', '陀', '苔', '黛', '鯛', '醍', '鷹', '啄', '托', '琢', '琢', '茸', '凧', '只', '辰', '巽', '竪', '辿', '樽', '坦', '歎', '湛', '耽', '檀', '弛', '智', '馳', '筑', '註', '猪', '猪', '喋', '寵', '帖', '暢', '牒', '脹', '蝶', '槌', '槻', '佃', '柘', '辻', '蔦', '綴', '椿', '紬', '悌', '挺', '梯', '汀', '禎', '禎', '蹄', '鄭', '釘', '鼎', '擢', '纏', '兎', '堵', '杜', '砥', '套', '宕', '祷', '董', '撞', '萄', '鳶', '寅', '酉', '惇', '敦', '沌', '遁', '凪', '薙', '灘', '捺', '楢', '馴', '楠', '汝', '賑', '廿', '濡', '禰', '祢', '乃', '之', '巴', '播', '杷', '琶', '芭', '煤', '這', '秤', '萩', '柏', '箔', '曝', '莫', '函', '肇', '筈', '幡', '畠', '鳩', '塙', '隼', '挽', '磐', '蕃', '庇', '斐', '緋', '樋', '枇', '毘', '琵', '柊', '疋', '彦', '菱', '畢', '桧', '紐', '彪', '瓢', '豹', '廟', '彬', '瀕', '斧', '芙', '撫', '葡', '蕪', '楓', '葺', '蕗', '淵', '吻', '焚', '頁', '碧', '瞥', '篇', '娩', '鞭', '圃', '甫', '輔', '戊', '菩', '捧', '朋', '萌', '蓬', '鋒', '鳳', '鵬', '卜', '殆', '幌', '哩', '槙', '柾', '鱒', '亦', '俣', '沫', '迄', '麿', '蔓', '巳', '箕', '湊', '蓑', '稔', '牟', '椋', '姪', '孟', '蒙', '儲', '勿', '尤', '籾', '貰', '匁', '也', '耶', '靖', '佑', '宥', '柚', '祐', '祐', '邑', '輿', '傭', '楊', '耀', '蓉', '遥', '淀', '螺', '洛', '蘭', '李', '裡', '掠', '劉', '溜', '琉', '亮', '凌', '梁', '稜', '諒', '遼', '淋', '琳', '鱗', '麟', '伶', '嶺', '怜', '玲', '憐', '漣', '煉', '簾', '蓮', '魯', '櫓', '狼', '禄', '肋', '倭', '鷲', '亙', '亘', '詫', '藁', '蕨', '椀', '碗', '侑', '俐', '凛', '凰', '勁', '奎', '崚', '巖', '巫', '已', '彗', '徠', '惺', '昊', '昴', '晏', '晄', '晨', '晟', '暉', '檜', '栞', '梛', '椰', '橙', '櫂', '毬', '洸', '洵', '渾', '滉', '漱', '澪', '煌', '燎', '燿', '珈', '珀', '琥', '瑶', '皓', '眸', '祿', '稟', '穰', '穹', '笙', '絆', '綺', '綸', '羚', '翔', '脩', '苺', '茉', '莉', '菫', '萠', '蕾', '詢', '諄', '赳', '迪', '逞', '釉', '頌', '颯', '驍', '麒', '黎', '堯', '槇', '遙', '凜', '熙', '俠', '俱', '吞', '摑', '焰', '禱', '簞', '繡', '繫', '萊', '蔣', '蟬', '蠟', '醬', '顚', '鷗' },
            new char [] { '逸', '謁', '薗', '禍', '悔', '海', '漢', '器', '祈', '響', '勤', '謹', '駈', '穀', '祉', '視', '煮', '社', '者', '臭', '祝', '暑', '署', '諸', '祥', '神', '節', '曾', '祖', '僧', '層', '憎', '贈', '瀧', '嘆', '著', '懲', '都', '嶋', '燈', '突', '難', '埜', '盃', '梅', '繁', '卑', '碑', '賓', '敏', '冨', '侮', '福', '勉', '峯', '墨', '欄', '龍', '虜', '類', '練', '廊', '朗', '乘', '亞', '佛', '來', '傳', '僞', '價', '儉', '兒', '凉', '剩', '劍', '勳', '卷', '單', '嚴', '圈', '國', '圓', '團', '壞', '壘', '壯', '壽', '奧', '奬', '孃', '實', '寢', '將', '專', '峽', '帶', '廣', '廳', '彈', '彌', '從', '恆', '惡', '惠', '愼', '應', '懷', '戰', '戲', '拔', '拜', '拂', '搜', '搖', '攝', '收', '敍', '晝', '曉', '條', '榮', '樂', '樣', '檢', '櫻', '盜', '氣', '淨', '滯', '澁', '濕', '燒', '爭', '爲', '狹', '默', '獸', '疊', '盡', '眞', '碎', '祕', '禪', '禮', '稻', '穗', '粹', '縣', '縱', '纖', '飜', '聽', '臟', '與', '莊', '萬', '藏', '藝', '藥', '衞', '裝', '覽', '謠', '讓', '賣', '轉', '醉', '釀', '鎭', '鑄', '陷', '險', '雜', '靜', '顯', '騷', '驗', '髮', '鷄', '齊', '卽', '增', '寬', '巢', '徵', '德', '揭', '擊', '晚', '曆', '橫', '步', '歷', '每', '涉', '淚', '渴', '溫', '瀨', '狀', '瘦', '綠', '緖', '緣', '薰', '虛', '賴', '郞', '錄', '鍊', '黃', '黑' }
        };

        public static bool IsJinmeiyoKanji (char value)
        {
            return MemoryExtensions.Contains (JinmeiyoKanji [0], value) || MemoryExtensions.Contains (JinmeiyoKanji [1], value);
        }
    }
}
